ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h

/****************************************************************************************************//**
 * @file     ATSAM4E16E.h
 *
 * @brief    CMSIS Cortex-M4 Peripheral Access Layer Header File for
 *           ATSAM4E16E from Atmel.
 *
 * @version  V0
 * @date     15. March 2017
 *
 * @note     Generated with SVDConv V2.85b 
 *           from CMSIS SVD File 'ATSAM4E16E.svd' Version 0,
 *******************************************************************************************************/



/** @addtogroup Atmel
  * @{
  */

/** @addtogroup ATSAM4E16E
  * @{
  */

#ifndef ATSAM4E16E_H
#define ATSAM4E16E_H

#ifdef __cplusplus
extern "C" {
#endif


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* -------------------  Cortex-M4 Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NonMaskableInt_IRQn           = -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */
  MemoryManagement_IRQn         = -12,              /*!<   4  Memory Management, MPU mismatch, including Access Violation
                                                         and No Match                                                          */
  BusFault_IRQn                 = -11,              /*!<   5  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                         related Fault                                                         */
  UsageFault_IRQn               = -10,              /*!<   6  Usage Fault, i.e. Undef Instruction, Illegal State Transition    */
  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */
  DebugMonitor_IRQn             =  -4,              /*!<  12  Debug Monitor                                                    */
  PendSV_IRQn                   =  -2,              /*!<  14  Pendable request for system service                              */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* --------------------  ATSAM4E16E Specific Interrupt Numbers  ------------------- */
  ID_PMC_IRQn                   =   5,              /*!<   5  ID_PMC                                                           */
  ID_EFC_IRQn                   =   6,              /*!<   6  ID_EFC                                                           */
  ID_UART0_IRQn                 =   7,              /*!<   7  ID_UART0                                                         */
  ID_PIOA_IRQn                  =   9,              /*!<   9  ID_PIOA                                                          */
  ID_PIOB_IRQn                  =  10,              /*!<  10  ID_PIOB                                                          */
  ID_PIOC_IRQn                  =  11,              /*!<  11  ID_PIOC                                                          */
  ID_PIOD_IRQn                  =  12,              /*!<  12  ID_PIOD                                                          */
  ID_PIOE_IRQn                  =  13,              /*!<  13  ID_PIOE                                                          */
  ID_USART0_IRQn                =  14,              /*!<  14  ID_USART0                                                        */
  ID_USART1_IRQn                =  15,              /*!<  15  ID_USART1                                                        */
  ID_HSMCI_IRQn                 =  16,              /*!<  16  ID_HSMCI                                                         */
  ID_TWI0_IRQn                  =  17,              /*!<  17  ID_TWI0                                                          */
  ID_TWI1_IRQn                  =  18,              /*!<  18  ID_TWI1                                                          */
  ID_SPI_IRQn                   =  19,              /*!<  19  ID_SPI                                                           */
  ID_DMAC_IRQn                  =  20,              /*!<  20  ID_DMAC                                                          */
  ID_TC0_IRQn                   =  21,              /*!<  21  ID_TC0                                                           */
  ID_TC1_IRQn                   =  22,              /*!<  22  ID_TC1                                                           */
  ID_TC2_IRQn                   =  23,              /*!<  23  ID_TC2                                                           */
  ID_TC3_IRQn                   =  24,              /*!<  24  ID_TC3                                                           */
  ID_TC4_IRQn                   =  25,              /*!<  25  ID_TC4                                                           */
  ID_TC5_IRQn                   =  26,              /*!<  26  ID_TC5                                                           */
  ID_TC6_IRQn                   =  27,              /*!<  27  ID_TC6                                                           */
  ID_TC7_IRQn                   =  28,              /*!<  28  ID_TC7                                                           */
  ID_TC8_IRQn                   =  29,              /*!<  29  ID_TC8                                                           */
  ID_AFEC0_IRQn                 =  30,              /*!<  30  ID_AFEC0                                                         */
  ID_AFEC1_IRQn                 =  31,              /*!<  31  ID_AFEC1                                                         */
  ID_DACC_IRQn                  =  32,              /*!<  32  ID_DACC                                                          */
  ID_ACC_IRQn                   =  33,              /*!<  33  ID_ACC                                                           */
  ID_UDP_IRQn                   =  35,              /*!<  35  ID_UDP                                                           */
  ID_PWM_IRQn                   =  36,              /*!<  36  ID_PWM                                                           */
  ID_CAN0_IRQn                  =  37,              /*!<  37  ID_CAN0                                                          */
  ID_CAN1_IRQn                  =  38,              /*!<  38  ID_CAN1                                                          */
  ID_AES_IRQn                   =  39,              /*!<  39  ID_AES                                                           */
  ID_GMAC_IRQn                  =  44,              /*!<  44  ID_GMAC                                                          */
  ID_UART1_IRQn                 =  45               /*!<  45  ID_UART1                                                         */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the Cortex-M4 Processor and Core Peripherals---------------- */
#define __CM4_REV                 0x0000            /*!< Cortex-M4 Core Revision                                               */
#define __MPU_PRESENT                  0            /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS               4            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
#define __FPU_PRESENT                  1            /*!< FPU present or not                                                    */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm4.h"                               /*!< Cortex-M4 processor and core peripherals                              */
#include "system_SAM4E.h"                           /*!< ATSAM4E16E System                                                     */


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif



/* ================================================================================ */
/* ================                       PWM                      ================ */
/* ================================================================================ */


/**
  * @brief Pulse Width Modulation Controller (PWM)
  */

