ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h
typedef struct {                                    /*!< PWM Structure                                                         */
  __IO uint32_t  CLK;                               /*!< PWM Clock Register                                                    */
  __O  uint32_t  ENA;                               /*!< PWM Enable Register                                                   */
  __O  uint32_t  DIS;                               /*!< PWM Disable Register                                                  */
  __I  uint32_t  SR;                                /*!< PWM Status Register                                                   */
  __O  uint32_t  IER1;                              /*!< PWM Interrupt Enable Register 1                                       */
  __O  uint32_t  IDR1;                              /*!< PWM Interrupt Disable Register 1                                      */
  __I  uint32_t  IMR1;                              /*!< PWM Interrupt Mask Register 1                                         */
  __I  uint32_t  ISR1;                              /*!< PWM Interrupt Status Register 1                                       */
  __IO uint32_t  SCM;                               /*!< PWM Sync Channels Mode Register                                       */
  __I  uint32_t  RESERVED;
  __IO uint32_t  SCUC;                              /*!< PWM Sync Channels Update Control Register                             */
  __IO uint32_t  SCUP;                              /*!< PWM Sync Channels Update Period Register                              */
  __O  uint32_t  SCUPUPD;                           /*!< PWM Sync Channels Update Period Update Register                       */
  __O  uint32_t  IER2;                              /*!< PWM Interrupt Enable Register 2                                       */
  __O  uint32_t  IDR2;                              /*!< PWM Interrupt Disable Register 2                                      */
  __I  uint32_t  IMR2;                              /*!< PWM Interrupt Mask Register 2                                         */
  __I  uint32_t  ISR2;                              /*!< PWM Interrupt Status Register 2                                       */
  __IO uint32_t  OOV;                               /*!< PWM Output Override Value Register                                    */
  __IO uint32_t  OS;                                /*!< PWM Output Selection Register                                         */
  __O  uint32_t  OSS;                               /*!< PWM Output Selection Set Register                                     */
  __O  uint32_t  OSC;                               /*!< PWM Output Selection Clear Register                                   */
  __O  uint32_t  OSSUPD;                            /*!< PWM Output Selection Set Update Register                              */
  __O  uint32_t  OSCUPD;                            /*!< PWM Output Selection Clear Update Register                            */
  __IO uint32_t  FMR;                               /*!< PWM Fault Mode Register                                               */
  __I  uint32_t  FSR;                               /*!< PWM Fault Status Register                                             */
  __O  uint32_t  FCR;                               /*!< PWM Fault Clear Register                                              */
  __IO uint32_t  FPV1;                              /*!< PWM Fault Protection Value Register 1                                 */
  __IO uint32_t  FPE;                               /*!< PWM Fault Protection Enable Register                                  */
  __I  uint32_t  RESERVED1[3];
  __IO uint32_t  ELMR0;                             /*!< PWM Event Line 0 Mode Register                                        */
  __IO uint32_t  ELMR1;                             /*!< PWM Event Line 0 Mode Register                                        */
  __I  uint32_t  RESERVED2[7];
  __IO uint32_t  SSPR;                              /*!< PWM Spread Spectrum Register                                          */
  __O  uint32_t  SSPUP;                             /*!< PWM Spread Spectrum Update Register                                   */
  __I  uint32_t  RESERVED3[2];
  __IO uint32_t  SMMR;                              /*!< PWM Stepper Motor Mode Register                                       */
  __I  uint32_t  RESERVED4[3];
  __IO uint32_t  FPV2;                              /*!< PWM Fault Protection Value 2 Register                                 */
  __I  uint32_t  RESERVED5[8];
  __O  uint32_t  WPCR;                              /*!< PWM Write Protect Control Register                                    */
  __I  uint32_t  WPSR;                              /*!< PWM Write Protect Status Register                                     */
  __I  uint32_t  RESERVED6[7];
  __IO uint32_t  TPR;                               /*!< Transmit Pointer Register                                             */
  __IO uint32_t  TCR;                               /*!< Transmit Counter Register                                             */
  __I  uint32_t  RESERVED7[2];
  __IO uint32_t  TNPR;                              /*!< Transmit Next Pointer Register                                        */
  __IO uint32_t  TNCR;                              /*!< Transmit Next Counter Register                                        */
  __O  uint32_t  PTCR;                              /*!< Transfer Control Register                                             */
  __I  uint32_t  PTSR;                              /*!< Transfer Status Register                                              */
  __I  uint32_t  RESERVED8[2];
  __IO uint32_t  CMPV0;                             /*!< PWM Comparison 0 Value Register                                       */
  __O  uint32_t  CMPVUPD0;                          /*!< PWM Comparison 0 Value Update Register                                */
  __IO uint32_t  CMPM0;                             /*!< PWM Comparison 0 Mode Register                                        */
  __O  uint32_t  CMPMUPD0;                          /*!< PWM Comparison 0 Mode Update Register                                 */
  __IO uint32_t  CMPV1;                             /*!< PWM Comparison 1 Value Register                                       */
  __O  uint32_t  CMPVUPD1;                          /*!< PWM Comparison 1 Value Update Register                                */
  __IO uint32_t  CMPM1;                             /*!< PWM Comparison 1 Mode Register                                        */
  __O  uint32_t  CMPMUPD1;                          /*!< PWM Comparison 1 Mode Update Register                                 */
  __IO uint32_t  CMPV2;                             /*!< PWM Comparison 2 Value Register                                       */
  __O  uint32_t  CMPVUPD2;                          /*!< PWM Comparison 2 Value Update Register                                */
  __IO uint32_t  CMPM2;                             /*!< PWM Comparison 2 Mode Register                                        */
  __O  uint32_t  CMPMUPD2;                          /*!< PWM Comparison 2 Mode Update Register                                 */
  __IO uint32_t  CMPV3;                             /*!< PWM Comparison 3 Value Register                                       */
  __O  uint32_t  CMPVUPD3;                          /*!< PWM Comparison 3 Value Update Register                                */
  __IO uint32_t  CMPM3;                             /*!< PWM Comparison 3 Mode Register                                        */
  __O  uint32_t  CMPMUPD3;                          /*!< PWM Comparison 3 Mode Update Register                                 */
  __IO uint32_t  CMPV4;                             /*!< PWM Comparison 4 Value Register                                       */
  __O  uint32_t  CMPVUPD4;                          /*!< PWM Comparison 4 Value Update Register                                */
  __IO uint32_t  CMPM4;                             /*!< PWM Comparison 4 Mode Register                                        */
  __O  uint32_t  CMPMUPD4;                          /*!< PWM Comparison 4 Mode Update Register                                 */
  __IO uint32_t  CMPV5;                             /*!< PWM Comparison 5 Value Register                                       */
  __O  uint32_t  CMPVUPD5;                          /*!< PWM Comparison 5 Value Update Register                                */
  __IO uint32_t  CMPM5;                             /*!< PWM Comparison 5 Mode Register                                        */
  __O  uint32_t  CMPMUPD5;                          /*!< PWM Comparison 5 Mode Update Register                                 */
  __IO uint32_t  CMPV6;                             /*!< PWM Comparison 6 Value Register                                       */
  __O  uint32_t  CMPVUPD6;                          /*!< PWM Comparison 6 Value Update Register                                */
  __IO uint32_t  CMPM6;                             /*!< PWM Comparison 6 Mode Register                                        */
  __O  uint32_t  CMPMUPD6;                          /*!< PWM Comparison 6 Mode Update Register                                 */
  __IO uint32_t  CMPV7;                             /*!< PWM Comparison 7 Value Register                                       */
  __O  uint32_t  CMPVUPD7;                          /*!< PWM Comparison 7 Value Update Register                                */
  __IO uint32_t  CMPM7;                             /*!< PWM Comparison 7 Mode Register                                        */
  __O  uint32_t  CMPMUPD7;                          /*!< PWM Comparison 7 Mode Update Register                                 */
  __I  uint32_t  RESERVED9[20];
  __IO uint32_t  CMR0;                              /*!< PWM Channel Mode Register (ch_num = 0)                                */
  __IO uint32_t  CDTY0;                             /*!< PWM Channel Duty Cycle Register (ch_num = 0)                          */
  __O  uint32_t  CDTYUPD0;                          /*!< PWM Channel Duty Cycle Update Register (ch_num = 0)                   */
  __IO uint32_t  CPRD0;                             /*!< PWM Channel Period Register (ch_num = 0)                              */
  __O  uint32_t  CPRDUPD0;                          /*!< PWM Channel Period Update Register (ch_num = 0)                       */
  __I  uint32_t  CCNT0;                             /*!< PWM Channel Counter Register (ch_num = 0)                             */
  __IO uint32_t  DT0;                               /*!< PWM Channel Dead Time Register (ch_num = 0)                           */
  __O  uint32_t  DTUPD0;                            /*!< PWM Channel Dead Time Update Register (ch_num = 0)                    */
  __IO uint32_t  CMR1;                              /*!< PWM Channel Mode Register (ch_num = 1)                                */
  __IO uint32_t  CDTY1;                             /*!< PWM Channel Duty Cycle Register (ch_num = 1)                          */
  __O  uint32_t  CDTYUPD1;                          /*!< PWM Channel Duty Cycle Update Register (ch_num = 1)                   */
  __IO uint32_t  CPRD1;                             /*!< PWM Channel Period Register (ch_num = 1)                              */
  __O  uint32_t  CPRDUPD1;                          /*!< PWM Channel Period Update Register (ch_num = 1)                       */
  __I  uint32_t  CCNT1;                             /*!< PWM Channel Counter Register (ch_num = 1)                             */
  __IO uint32_t  DT1;                               /*!< PWM Channel Dead Time Register (ch_num = 1)                           */
  __O  uint32_t  DTUPD1;                            /*!< PWM Channel Dead Time Update Register (ch_num = 1)                    */
  __IO uint32_t  CMR2;                              /*!< PWM Channel Mode Register (ch_num = 2)                                */
  __IO uint32_t  CDTY2;                             /*!< PWM Channel Duty Cycle Register (ch_num = 2)                          */
  __O  uint32_t  CDTYUPD2;                          /*!< PWM Channel Duty Cycle Update Register (ch_num = 2)                   */
  __IO uint32_t  CPRD2;                             /*!< PWM Channel Period Register (ch_num = 2)                              */
  __O  uint32_t  CPRDUPD2;                          /*!< PWM Channel Period Update Register (ch_num = 2)                       */
  __I  uint32_t  CCNT2;                             /*!< PWM Channel Counter Register (ch_num = 2)                             */
  __IO uint32_t  DT2;                               /*!< PWM Channel Dead Time Register (ch_num = 2)                           */
  __O  uint32_t  DTUPD2;                            /*!< PWM Channel Dead Time Update Register (ch_num = 2)                    */
  __IO uint32_t  CMR3;                              /*!< PWM Channel Mode Register (ch_num = 3)                                */
  __IO uint32_t  CDTY3;                             /*!< PWM Channel Duty Cycle Register (ch_num = 3)                          */
  __O  uint32_t  CDTYUPD3;                          /*!< PWM Channel Duty Cycle Update Register (ch_num = 3)                   */
  __IO uint32_t  CPRD3;                             /*!< PWM Channel Period Register (ch_num = 3)                              */
  __O  uint32_t  CPRDUPD3;                          /*!< PWM Channel Period Update Register (ch_num = 3)                       */
  __I  uint32_t  CCNT3;                             /*!< PWM Channel Counter Register (ch_num = 3)                             */
  __IO uint32_t  DT3;                               /*!< PWM Channel Dead Time Register (ch_num = 3)                           */
  __O  uint32_t  DTUPD3;                            /*!< PWM Channel Dead Time Update Register (ch_num = 3)                    */
  __I  uint32_t  RESERVED10[96];
  __O  uint32_t  CMUPD0;                            /*!< PWM Channel Mode Update Register (ch_num = 0)                         */
  __IO uint32_t  CAE0;                              /*!< PWM Channel Additional Edge Register (ch_num = 0)                     */
  __O  uint32_t  CAEUPD0;                           /*!< PWM Channel Additional Edge Update Register (ch_num = 0)              */
  __I  uint32_t  RESERVED11[5];
  __O  uint32_t  CMUPD1;                            /*!< PWM Channel Mode Update Register (ch_num = 1)                         */
  __IO uint32_t  CAE1;                              /*!< PWM Channel Additional Edge Register (ch_num = 1)                     */
  __O  uint32_t  CAEUPD1;                           /*!< PWM Channel Additional Edge Update Register (ch_num = 1)              */
  __I  uint32_t  RESERVED12[5];
  __O  uint32_t  CMUPD2;                            /*!< PWM Channel Mode Update Register (ch_num = 2)                         */
  __IO uint32_t  CAE2;                              /*!< PWM Channel Additional Edge Register (ch_num = 2)                     */
  __O  uint32_t  CAEUPD2;                           /*!< PWM Channel Additional Edge Update Register (ch_num = 2)              */
  __I  uint32_t  RESERVED13[5];
  __O  uint32_t  CMUPD3;                            /*!< PWM Channel Mode Update Register (ch_num = 3)                         */
  __IO uint32_t  CAE3;                              /*!< PWM Channel Additional Edge Register (ch_num = 3)                     */
  __O  uint32_t  CAEUPD3;                           /*!< PWM Channel Additional Edge Update Register (ch_num = 3)              */
} PWM_Type;


/* ================================================================================ */
/* ================                       AES                      ================ */
/* ================================================================================ */


/**
  * @brief Advanced Encryption Standard (AES)
  */

typedef struct {                                    /*!< AES Structure                                                         */
  __O  uint32_t  CR;                                /*!< Control Register                                                      */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __I  uint32_t  RESERVED[2];
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  ISR;                               /*!< Interrupt Status Register                                             */
  __O  uint32_t  KEYWR0;                            /*!< Key Word Register                                                     */
  __O  uint32_t  KEYWR1;                            /*!< Key Word Register                                                     */
  __O  uint32_t  KEYWR2;                            /*!< Key Word Register                                                     */
  __O  uint32_t  KEYWR3;                            /*!< Key Word Register                                                     */
  __O  uint32_t  KEYWR4;                            /*!< Key Word Register                                                     */
  __O  uint32_t  KEYWR5;                            /*!< Key Word Register                                                     */
  __O  uint32_t  KEYWR6;                            /*!< Key Word Register                                                     */
  __O  uint32_t  KEYWR7;                            /*!< Key Word Register                                                     */
  __O  uint32_t  IDATAR0;                           /*!< Input Data Register                                                   */
  __O  uint32_t  IDATAR1;                           /*!< Input Data Register                                                   */
  __O  uint32_t  IDATAR2;                           /*!< Input Data Register                                                   */
  __O  uint32_t  IDATAR3;                           /*!< Input Data Register                                                   */
  __I  uint32_t  ODATAR0;                           /*!< Output Data Register                                                  */
  __I  uint32_t  ODATAR1;                           /*!< Output Data Register                                                  */
  __I  uint32_t  ODATAR2;                           /*!< Output Data Register                                                  */
  __I  uint32_t  ODATAR3;                           /*!< Output Data Register                                                  */
  __O  uint32_t  IVR0;                              /*!< Initialization Vector Register                                        */
  __O  uint32_t  IVR1;                              /*!< Initialization Vector Register                                        */
  __O  uint32_t  IVR2;                              /*!< Initialization Vector Register                                        */
  __O  uint32_t  IVR3;                              /*!< Initialization Vector Register                                        */
} AES_Type;


/* ================================================================================ */
/* ================                      CAN0                      ================ */
/* ================================================================================ */


/**
  * @brief Controller Area Network 0 (CAN0)
  */

