ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h
typedef struct {                                    /*!< CAN0 Structure                                                        */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  SR;                                /*!< Status Register                                                       */
  __IO uint32_t  BR;                                /*!< Baudrate Register                                                     */
  __I  uint32_t  TIM;                               /*!< Timer Register                                                        */
  __I  uint32_t  TIMESTP;                           /*!< Timestamp Register                                                    */
  __I  uint32_t  ECR;                               /*!< Error Counter Register                                                */
  __O  uint32_t  TCR;                               /*!< Transfer Command Register                                             */
  __O  uint32_t  ACR;                               /*!< Abort Command Register                                                */
  __I  uint32_t  RESERVED[46];
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  WPSR;                              /*!< Write Protect Status Register                                         */
  __I  uint32_t  RESERVED1[69];
  __IO uint32_t  MMR0;                              /*!< Mailbox Mode Register (MB = 0)                                        */
  __IO uint32_t  MAM0;                              /*!< Mailbox Acceptance Mask Register (MB = 0)                             */
  __IO uint32_t  MID0;                              /*!< Mailbox ID Register (MB = 0)                                          */
  __I  uint32_t  MFID0;                             /*!< Mailbox Family ID Register (MB = 0)                                   */
  __I  uint32_t  MSR0;                              /*!< Mailbox Status Register (MB = 0)                                      */
  __IO uint32_t  MDL0;                              /*!< Mailbox Data Low Register (MB = 0)                                    */
  __IO uint32_t  MDH0;                              /*!< Mailbox Data High Register (MB = 0)                                   */
  __O  uint32_t  MCR0;                              /*!< Mailbox Control Register (MB = 0)                                     */
  __IO uint32_t  MMR1;                              /*!< Mailbox Mode Register (MB = 1)                                        */
  __IO uint32_t  MAM1;                              /*!< Mailbox Acceptance Mask Register (MB = 1)                             */
  __IO uint32_t  MID1;                              /*!< Mailbox ID Register (MB = 1)                                          */
  __I  uint32_t  MFID1;                             /*!< Mailbox Family ID Register (MB = 1)                                   */
  __I  uint32_t  MSR1;                              /*!< Mailbox Status Register (MB = 1)                                      */
  __IO uint32_t  MDL1;                              /*!< Mailbox Data Low Register (MB = 1)                                    */
  __IO uint32_t  MDH1;                              /*!< Mailbox Data High Register (MB = 1)                                   */
  __O  uint32_t  MCR1;                              /*!< Mailbox Control Register (MB = 1)                                     */
  __IO uint32_t  MMR2;                              /*!< Mailbox Mode Register (MB = 2)                                        */
  __IO uint32_t  MAM2;                              /*!< Mailbox Acceptance Mask Register (MB = 2)                             */
  __IO uint32_t  MID2;                              /*!< Mailbox ID Register (MB = 2)                                          */
  __I  uint32_t  MFID2;                             /*!< Mailbox Family ID Register (MB = 2)                                   */
  __I  uint32_t  MSR2;                              /*!< Mailbox Status Register (MB = 2)                                      */
  __IO uint32_t  MDL2;                              /*!< Mailbox Data Low Register (MB = 2)                                    */
  __IO uint32_t  MDH2;                              /*!< Mailbox Data High Register (MB = 2)                                   */
  __O  uint32_t  MCR2;                              /*!< Mailbox Control Register (MB = 2)                                     */
  __IO uint32_t  MMR3;                              /*!< Mailbox Mode Register (MB = 3)                                        */
  __IO uint32_t  MAM3;                              /*!< Mailbox Acceptance Mask Register (MB = 3)                             */
  __IO uint32_t  MID3;                              /*!< Mailbox ID Register (MB = 3)                                          */
  __I  uint32_t  MFID3;                             /*!< Mailbox Family ID Register (MB = 3)                                   */
  __I  uint32_t  MSR3;                              /*!< Mailbox Status Register (MB = 3)                                      */
  __IO uint32_t  MDL3;                              /*!< Mailbox Data Low Register (MB = 3)                                    */
  __IO uint32_t  MDH3;                              /*!< Mailbox Data High Register (MB = 3)                                   */
  __O  uint32_t  MCR3;                              /*!< Mailbox Control Register (MB = 3)                                     */
  __IO uint32_t  MMR4;                              /*!< Mailbox Mode Register (MB = 4)                                        */
  __IO uint32_t  MAM4;                              /*!< Mailbox Acceptance Mask Register (MB = 4)                             */
  __IO uint32_t  MID4;                              /*!< Mailbox ID Register (MB = 4)                                          */
  __I  uint32_t  MFID4;                             /*!< Mailbox Family ID Register (MB = 4)                                   */
  __I  uint32_t  MSR4;                              /*!< Mailbox Status Register (MB = 4)                                      */
  __IO uint32_t  MDL4;                              /*!< Mailbox Data Low Register (MB = 4)                                    */
  __IO uint32_t  MDH4;                              /*!< Mailbox Data High Register (MB = 4)                                   */
  __O  uint32_t  MCR4;                              /*!< Mailbox Control Register (MB = 4)                                     */
  __IO uint32_t  MMR5;                              /*!< Mailbox Mode Register (MB = 5)                                        */
  __IO uint32_t  MAM5;                              /*!< Mailbox Acceptance Mask Register (MB = 5)                             */
  __IO uint32_t  MID5;                              /*!< Mailbox ID Register (MB = 5)                                          */
  __I  uint32_t  MFID5;                             /*!< Mailbox Family ID Register (MB = 5)                                   */
  __I  uint32_t  MSR5;                              /*!< Mailbox Status Register (MB = 5)                                      */
  __IO uint32_t  MDL5;                              /*!< Mailbox Data Low Register (MB = 5)                                    */
  __IO uint32_t  MDH5;                              /*!< Mailbox Data High Register (MB = 5)                                   */
  __O  uint32_t  MCR5;                              /*!< Mailbox Control Register (MB = 5)                                     */
  __IO uint32_t  MMR6;                              /*!< Mailbox Mode Register (MB = 6)                                        */
  __IO uint32_t  MAM6;                              /*!< Mailbox Acceptance Mask Register (MB = 6)                             */
  __IO uint32_t  MID6;                              /*!< Mailbox ID Register (MB = 6)                                          */
  __I  uint32_t  MFID6;                             /*!< Mailbox Family ID Register (MB = 6)                                   */
  __I  uint32_t  MSR6;                              /*!< Mailbox Status Register (MB = 6)                                      */
  __IO uint32_t  MDL6;                              /*!< Mailbox Data Low Register (MB = 6)                                    */
  __IO uint32_t  MDH6;                              /*!< Mailbox Data High Register (MB = 6)                                   */
  __O  uint32_t  MCR6;                              /*!< Mailbox Control Register (MB = 6)                                     */
  __IO uint32_t  MMR7;                              /*!< Mailbox Mode Register (MB = 7)                                        */
  __IO uint32_t  MAM7;                              /*!< Mailbox Acceptance Mask Register (MB = 7)                             */
  __IO uint32_t  MID7;                              /*!< Mailbox ID Register (MB = 7)                                          */
  __I  uint32_t  MFID7;                             /*!< Mailbox Family ID Register (MB = 7)                                   */
  __I  uint32_t  MSR7;                              /*!< Mailbox Status Register (MB = 7)                                      */
  __IO uint32_t  MDL7;                              /*!< Mailbox Data Low Register (MB = 7)                                    */
  __IO uint32_t  MDH7;                              /*!< Mailbox Data High Register (MB = 7)                                   */
  __O  uint32_t  MCR7;                              /*!< Mailbox Control Register (MB = 7)                                     */
} CAN0_Type;


/* ================================================================================ */
/* ================                      CAN1                      ================ */
/* ================================================================================ */


/**
  * @brief Controller Area Network 1 (CAN1)
  */

typedef struct {                                    /*!< CAN1 Structure                                                        */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  SR;                                /*!< Status Register                                                       */
  __IO uint32_t  BR;                                /*!< Baudrate Register                                                     */
  __I  uint32_t  TIM;                               /*!< Timer Register                                                        */
  __I  uint32_t  TIMESTP;                           /*!< Timestamp Register                                                    */
  __I  uint32_t  ECR;                               /*!< Error Counter Register                                                */
  __O  uint32_t  TCR;                               /*!< Transfer Command Register                                             */
  __O  uint32_t  ACR;                               /*!< Abort Command Register                                                */
  __I  uint32_t  RESERVED[46];
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  WPSR;                              /*!< Write Protect Status Register                                         */
  __I  uint32_t  RESERVED1[69];
  __IO uint32_t  MMR0;                              /*!< Mailbox Mode Register (MB = 0)                                        */
  __IO uint32_t  MAM0;                              /*!< Mailbox Acceptance Mask Register (MB = 0)                             */
  __IO uint32_t  MID0;                              /*!< Mailbox ID Register (MB = 0)                                          */
  __I  uint32_t  MFID0;                             /*!< Mailbox Family ID Register (MB = 0)                                   */
  __I  uint32_t  MSR0;                              /*!< Mailbox Status Register (MB = 0)                                      */
  __IO uint32_t  MDL0;                              /*!< Mailbox Data Low Register (MB = 0)                                    */
  __IO uint32_t  MDH0;                              /*!< Mailbox Data High Register (MB = 0)                                   */
  __O  uint32_t  MCR0;                              /*!< Mailbox Control Register (MB = 0)                                     */
  __IO uint32_t  MMR1;                              /*!< Mailbox Mode Register (MB = 1)                                        */
  __IO uint32_t  MAM1;                              /*!< Mailbox Acceptance Mask Register (MB = 1)                             */
  __IO uint32_t  MID1;                              /*!< Mailbox ID Register (MB = 1)                                          */
  __I  uint32_t  MFID1;                             /*!< Mailbox Family ID Register (MB = 1)                                   */
  __I  uint32_t  MSR1;                              /*!< Mailbox Status Register (MB = 1)                                      */
  __IO uint32_t  MDL1;                              /*!< Mailbox Data Low Register (MB = 1)                                    */
  __IO uint32_t  MDH1;                              /*!< Mailbox Data High Register (MB = 1)                                   */
  __O  uint32_t  MCR1;                              /*!< Mailbox Control Register (MB = 1)                                     */
  __IO uint32_t  MMR2;                              /*!< Mailbox Mode Register (MB = 2)                                        */
  __IO uint32_t  MAM2;                              /*!< Mailbox Acceptance Mask Register (MB = 2)                             */
  __IO uint32_t  MID2;                              /*!< Mailbox ID Register (MB = 2)                                          */
  __I  uint32_t  MFID2;                             /*!< Mailbox Family ID Register (MB = 2)                                   */
  __I  uint32_t  MSR2;                              /*!< Mailbox Status Register (MB = 2)                                      */
  __IO uint32_t  MDL2;                              /*!< Mailbox Data Low Register (MB = 2)                                    */
  __IO uint32_t  MDH2;                              /*!< Mailbox Data High Register (MB = 2)                                   */
  __O  uint32_t  MCR2;                              /*!< Mailbox Control Register (MB = 2)                                     */
  __IO uint32_t  MMR3;                              /*!< Mailbox Mode Register (MB = 3)                                        */
  __IO uint32_t  MAM3;                              /*!< Mailbox Acceptance Mask Register (MB = 3)                             */
  __IO uint32_t  MID3;                              /*!< Mailbox ID Register (MB = 3)                                          */
  __I  uint32_t  MFID3;                             /*!< Mailbox Family ID Register (MB = 3)                                   */
  __I  uint32_t  MSR3;                              /*!< Mailbox Status Register (MB = 3)                                      */
  __IO uint32_t  MDL3;                              /*!< Mailbox Data Low Register (MB = 3)                                    */
  __IO uint32_t  MDH3;                              /*!< Mailbox Data High Register (MB = 3)                                   */
  __O  uint32_t  MCR3;                              /*!< Mailbox Control Register (MB = 3)                                     */
  __IO uint32_t  MMR4;                              /*!< Mailbox Mode Register (MB = 4)                                        */
  __IO uint32_t  MAM4;                              /*!< Mailbox Acceptance Mask Register (MB = 4)                             */
  __IO uint32_t  MID4;                              /*!< Mailbox ID Register (MB = 4)                                          */
  __I  uint32_t  MFID4;                             /*!< Mailbox Family ID Register (MB = 4)                                   */
  __I  uint32_t  MSR4;                              /*!< Mailbox Status Register (MB = 4)                                      */
  __IO uint32_t  MDL4;                              /*!< Mailbox Data Low Register (MB = 4)                                    */
  __IO uint32_t  MDH4;                              /*!< Mailbox Data High Register (MB = 4)                                   */
  __O  uint32_t  MCR4;                              /*!< Mailbox Control Register (MB = 4)                                     */
  __IO uint32_t  MMR5;                              /*!< Mailbox Mode Register (MB = 5)                                        */
  __IO uint32_t  MAM5;                              /*!< Mailbox Acceptance Mask Register (MB = 5)                             */
  __IO uint32_t  MID5;                              /*!< Mailbox ID Register (MB = 5)                                          */
  __I  uint32_t  MFID5;                             /*!< Mailbox Family ID Register (MB = 5)                                   */
  __I  uint32_t  MSR5;                              /*!< Mailbox Status Register (MB = 5)                                      */
  __IO uint32_t  MDL5;                              /*!< Mailbox Data Low Register (MB = 5)                                    */
  __IO uint32_t  MDH5;                              /*!< Mailbox Data High Register (MB = 5)                                   */
  __O  uint32_t  MCR5;                              /*!< Mailbox Control Register (MB = 5)                                     */
  __IO uint32_t  MMR6;                              /*!< Mailbox Mode Register (MB = 6)                                        */
  __IO uint32_t  MAM6;                              /*!< Mailbox Acceptance Mask Register (MB = 6)                             */
  __IO uint32_t  MID6;                              /*!< Mailbox ID Register (MB = 6)                                          */
  __I  uint32_t  MFID6;                             /*!< Mailbox Family ID Register (MB = 6)                                   */
  __I  uint32_t  MSR6;                              /*!< Mailbox Status Register (MB = 6)                                      */
  __IO uint32_t  MDL6;                              /*!< Mailbox Data Low Register (MB = 6)                                    */
  __IO uint32_t  MDH6;                              /*!< Mailbox Data High Register (MB = 6)                                   */
  __O  uint32_t  MCR6;                              /*!< Mailbox Control Register (MB = 6)                                     */
  __IO uint32_t  MMR7;                              /*!< Mailbox Mode Register (MB = 7)                                        */
  __IO uint32_t  MAM7;                              /*!< Mailbox Acceptance Mask Register (MB = 7)                             */
  __IO uint32_t  MID7;                              /*!< Mailbox ID Register (MB = 7)                                          */
  __I  uint32_t  MFID7;                             /*!< Mailbox Family ID Register (MB = 7)                                   */
  __I  uint32_t  MSR7;                              /*!< Mailbox Status Register (MB = 7)                                      */
  __IO uint32_t  MDL7;                              /*!< Mailbox Data Low Register (MB = 7)                                    */
  __IO uint32_t  MDH7;                              /*!< Mailbox Data High Register (MB = 7)                                   */
  __O  uint32_t  MCR7;                              /*!< Mailbox Control Register (MB = 7)                                     */
} CAN1_Type;


/* ================================================================================ */
/* ================                      GMAC                      ================ */
/* ================================================================================ */


/**
  * @brief Gigabit Ethernet MAC (GMAC)
  */

