ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h
typedef struct {                                    /*!< GMAC Structure                                                        */
  __IO uint32_t  NCR;                               /*!< Network Control Register                                              */
  __IO uint32_t  NCFGR;                             /*!< Network Configuration Register                                        */
  __I  uint32_t  NSR;                               /*!< Network Status Register                                               */
  __IO uint32_t  UR;                                /*!< User Register                                                         */
  __IO uint32_t  DCFGR;                             /*!< DMA Configuration Register                                            */
  __IO uint32_t  TSR;                               /*!< Transmit Status Register                                              */
  __IO uint32_t  RBQB;                              /*!< Receive Buffer Queue Base Address                                     */
  __IO uint32_t  TBQB;                              /*!< Transmit Buffer Queue Base Address                                    */
  __IO uint32_t  RSR;                               /*!< Receive Status Register                                               */
  __I  uint32_t  ISR;                               /*!< Interrupt Status Register                                             */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __IO uint32_t  MAN;                               /*!< PHY Maintenance Register                                              */
  __I  uint32_t  RPQ;                               /*!< Received Pause Quantum Register                                       */
  __IO uint32_t  TPQ;                               /*!< Transmit Pause Quantum Register                                       */
  __I  uint32_t  RESERVED[16];
  __IO uint32_t  HRB;                               /*!< Hash Register Bottom [31:0]                                           */
  __IO uint32_t  HRT;                               /*!< Hash Register Top [63:32]                                             */
  __IO uint32_t  SAB1;                              /*!< Specific Address 1 Bottom [31:0] Register                             */
  __IO uint32_t  SAT1;                              /*!< Specific Address 1 Top [47:32] Register                               */
  __IO uint32_t  SAB2;                              /*!< Specific Address 2 Bottom [31:0] Register                             */
  __IO uint32_t  SAT2;                              /*!< Specific Address 2 Top [47:32] Register                               */
  __IO uint32_t  SAB3;                              /*!< Specific Address 3 Bottom [31:0] Register                             */
  __IO uint32_t  SAT3;                              /*!< Specific Address 3 Top [47:32] Register                               */
  __IO uint32_t  SAB4;                              /*!< Specific Address 4 Bottom [31:0] Register                             */
  __IO uint32_t  SAT4;                              /*!< Specific Address 4 Top [47:32] Register                               */
  __IO uint32_t  TIDM0;                             /*!< Type ID Match 1 Register                                              */
  __IO uint32_t  TIDM1;                             /*!< Type ID Match 1 Register                                              */
  __IO uint32_t  TIDM2;                             /*!< Type ID Match 1 Register                                              */
  __IO uint32_t  TIDM3;                             /*!< Type ID Match 1 Register                                              */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  IPGS;                              /*!< IPG Stretch Register                                                  */
  __IO uint32_t  SVLAN;                             /*!< Stacked VLAN Register                                                 */
  __IO uint32_t  TPFCP;                             /*!< Transmit PFC Pause Register                                           */
  __IO uint32_t  SAMB1;                             /*!< Specific Address 1 Mask Bottom [31:0] Register                        */
  __IO uint32_t  SAMT1;                             /*!< Specific Address 1 Mask Top [47:32] Register                          */
  __I  uint32_t  RESERVED2[12];
  __I  uint32_t  OTLO;                              /*!< Octets Transmitted [31:0] Register                                    */
  __I  uint32_t  OTHI;                              /*!< Octets Transmitted [47:32] Register                                   */
  __I  uint32_t  FT;                                /*!< Frames Transmitted Register                                           */
  __I  uint32_t  BCFT;                              /*!< Broadcast Frames Transmitted Register                                 */
  __I  uint32_t  MFT;                               /*!< Multicast Frames Transmitted Register                                 */
  __I  uint32_t  PFT;                               /*!< Pause Frames Transmitted Register                                     */
  __I  uint32_t  BFT64;                             /*!< 64 Byte Frames Transmitted Register                                   */
  __I  uint32_t  TBFT127;                           /*!< 65 to 127 Byte Frames Transmitted Register                            */
  __I  uint32_t  TBFT255;                           /*!< 128 to 255 Byte Frames Transmitted Register                           */
  __I  uint32_t  TBFT511;                           /*!< 256 to 511 Byte Frames Transmitted Register                           */
  __I  uint32_t  TBFT1023;                          /*!< 512 to 1023 Byte Frames Transmitted Register                          */
  __I  uint32_t  TBFT1518;                          /*!< 1024 to 1518 Byte Frames Transmitted Register                         */
  __I  uint32_t  GTBFT1518;                         /*!< Greater Than 1518 Byte Frames Transmitted Register                    */
  __I  uint32_t  TUR;                               /*!< Transmit Under Runs Register                                          */
  __I  uint32_t  SCF;                               /*!< Single Collision Frames Register                                      */
  __I  uint32_t  MCF;                               /*!< Multiple Collision Frames Register                                    */
  __I  uint32_t  EC;                                /*!< Excessive Collisions Register                                         */
  __I  uint32_t  LC;                                /*!< Late Collisions Register                                              */
  __I  uint32_t  DTF;                               /*!< Deferred Transmission Frames Register                                 */
  __I  uint32_t  CSE;                               /*!< Carrier Sense Errors Register                                         */
  __I  uint32_t  ORLO;                              /*!< Octets Received [31:0] Received                                       */
  __I  uint32_t  ORHI;                              /*!< Octets Received [47:32] Received                                      */
  __I  uint32_t  FR;                                /*!< Frames Received Register                                              */
  __I  uint32_t  BCFR;                              /*!< Broadcast Frames Received Register                                    */
  __I  uint32_t  MFR;                               /*!< Multicast Frames Received Register                                    */
  __I  uint32_t  PFR;                               /*!< Pause Frames Received Register                                        */
  __I  uint32_t  BFR64;                             /*!< 64 Byte Frames Received Register                                      */
  __I  uint32_t  TBFR127;                           /*!< 65 to 127 Byte Frames Received Register                               */
  __I  uint32_t  TBFR255;                           /*!< 128 to 255 Byte Frames Received Register                              */
  __I  uint32_t  TBFR511;                           /*!< 256 to 511Byte Frames Received Register                               */
  __I  uint32_t  TBFR1023;                          /*!< 512 to 1023 Byte Frames Received Register                             */
  __I  uint32_t  TBFR1518;                          /*!< 1024 to 1518 Byte Frames Received Register                            */
  __I  uint32_t  TMXBFR;                            /*!< 1519 to Maximum Byte Frames Received Register                         */
  __I  uint32_t  UFR;                               /*!< Undersize Frames Received Register                                    */
  __I  uint32_t  OFR;                               /*!< Oversize Frames Received Register                                     */
  __I  uint32_t  JR;                                /*!< Jabbers Received Register                                             */
  __I  uint32_t  FCSE;                              /*!< Frame Check Sequence Errors Register                                  */
  __I  uint32_t  LFFE;                              /*!< Length Field Frame Errors Register                                    */
  __I  uint32_t  RSE;                               /*!< Receive Symbol Errors Register                                        */
  __I  uint32_t  AE;                                /*!< Alignment Errors Register                                             */
  __I  uint32_t  RRE;                               /*!< Receive Resource Errors Register                                      */
  __I  uint32_t  ROE;                               /*!< Receive Overrun Register                                              */
  __I  uint32_t  IHCE;                              /*!< IP Header Checksum Errors Register                                    */
  __I  uint32_t  TCE;                               /*!< TCP Checksum Errors Register                                          */
  __I  uint32_t  UCE;                               /*!< UDP Checksum Errors Register                                          */
  __I  uint32_t  RESERVED3[5];
  __IO uint32_t  TSSS;                              /*!< 1588 Timer Sync Strobe Seconds Register                               */
  __IO uint32_t  TSSN;                              /*!< 1588 Timer Sync Strobe Nanoseconds Register                           */
  __IO uint32_t  TS;                                /*!< 1588 Timer Seconds Register                                           */
  __IO uint32_t  TN;                                /*!< 1588 Timer Nanoseconds Register                                       */
  __O  uint32_t  TA;                                /*!< 1588 Timer Adjust Register                                            */
  __IO uint32_t  TI;                                /*!< 1588 Timer Increment Register                                         */
  __I  uint32_t  EFTS;                              /*!< PTP Event Frame Transmitted Seconds                                   */
  __I  uint32_t  EFTN;                              /*!< PTP Event Frame Transmitted Nanoseconds                               */
  __I  uint32_t  EFRS;                              /*!< PTP Event Frame Received Seconds                                      */
  __I  uint32_t  EFRN;                              /*!< PTP Event Frame Received Nanoseconds                                  */
  __I  uint32_t  PEFTS;                             /*!< PTP Peer Event Frame Transmitted Seconds                              */
  __I  uint32_t  PEFTN;                             /*!< PTP Peer Event Frame Transmitted Nanoseconds                          */
  __I  uint32_t  PEFRS;                             /*!< PTP Peer Event Frame Received Seconds                                 */
  __I  uint32_t  PEFRN;                             /*!< PTP Peer Event Frame Received Nanoseconds                             */
} GMAC_Type;


/* ================================================================================ */
/* ================                      CRCCU                     ================ */
/* ================================================================================ */


/**
  * @brief Cyclic Redundancy Check Calculation Unit (CRCCU)
  */

typedef struct {                                    /*!< CRCCU Structure                                                       */
  __IO uint32_t  DSCR;                              /*!< CRCCU Descriptor Base Register                                        */
  __I  uint32_t  RESERVED;
  __O  uint32_t  DMA_EN;                            /*!< CRCCU DMA Enable Register                                             */
  __O  uint32_t  DMA_DIS;                           /*!< CRCCU DMA Disable Register                                            */
  __I  uint32_t  DMA_SR;                            /*!< CRCCU DMA Status Register                                             */
  __O  uint32_t  DMA_IER;                           /*!< CRCCU DMA Interrupt Enable Register                                   */
  __O  uint32_t  DMA_IDR;                           /*!< CRCCU DMA Interrupt Disable Register                                  */
  __I  uint32_t  DMA_IMR;                           /*!< CRCCU DMA Interrupt Mask Register                                     */
  __I  uint32_t  DMA_ISR;                           /*!< CRCCU DMA Interrupt Status Register                                   */
  __I  uint32_t  RESERVED1[4];
  __O  uint32_t  CR;                                /*!< CRCCU Control Register                                                */
  __IO uint32_t  MR;                                /*!< CRCCU Mode Register                                                   */
  __I  uint32_t  SR;                                /*!< CRCCU Status Register                                                 */
  __O  uint32_t  IER;                               /*!< CRCCU Interrupt Enable Register                                       */
  __O  uint32_t  IDR;                               /*!< CRCCU Interrupt Disable Register                                      */
  __I  uint32_t  IMR;                               /*!< CRCCU Interrupt Mask Register                                         */
  __I  uint32_t  ISR;                               /*!< CRCCU Interrupt Status Register                                       */
} CRCCU_Type;


/* ================================================================================ */
/* ================                       SMC                      ================ */
/* ================================================================================ */


/**
  * @brief Static Memory Controller (SMC)
  */

typedef struct {                                    /*!< SMC Structure                                                         */
  __IO uint32_t  SETUP0;                            /*!< SMC Setup Register (CS_number = 0)                                    */
  __IO uint32_t  PULSE0;                            /*!< SMC Pulse Register (CS_number = 0)                                    */
  __IO uint32_t  CYCLE0;                            /*!< SMC Cycle Register (CS_number = 0)                                    */
  __IO uint32_t  MODE0;                             /*!< SMC Mode Register (CS_number = 0)                                     */
  __IO uint32_t  SETUP1;                            /*!< SMC Setup Register (CS_number = 1)                                    */
  __IO uint32_t  PULSE1;                            /*!< SMC Pulse Register (CS_number = 1)                                    */
  __IO uint32_t  CYCLE1;                            /*!< SMC Cycle Register (CS_number = 1)                                    */
  __IO uint32_t  MODE1;                             /*!< SMC Mode Register (CS_number = 1)                                     */
  __IO uint32_t  SETUP2;                            /*!< SMC Setup Register (CS_number = 2)                                    */
  __IO uint32_t  PULSE2;                            /*!< SMC Pulse Register (CS_number = 2)                                    */
  __IO uint32_t  CYCLE2;                            /*!< SMC Cycle Register (CS_number = 2)                                    */
  __IO uint32_t  MODE2;                             /*!< SMC Mode Register (CS_number = 2)                                     */
  __IO uint32_t  SETUP3;                            /*!< SMC Setup Register (CS_number = 3)                                    */
  __IO uint32_t  PULSE3;                            /*!< SMC Pulse Register (CS_number = 3)                                    */
  __IO uint32_t  CYCLE3;                            /*!< SMC Cycle Register (CS_number = 3)                                    */
  __IO uint32_t  MODE3;                             /*!< SMC Mode Register (CS_number = 3)                                     */
  __I  uint32_t  RESERVED[16];
  __IO uint32_t  OCMS;                              /*!< SMC OCMS MODE Register                                                */
  __O  uint32_t  KEY1;                              /*!< SMC OCMS KEY1 Register                                                */
  __O  uint32_t  KEY2;                              /*!< SMC OCMS KEY2 Register                                                */
  __I  uint32_t  RESERVED1[22];
  __IO uint32_t  WPMR;                              /*!< SMC Write Protect Mode Register                                       */
  __I  uint32_t  WPSR;                              /*!< SMC Write Protect Status Register                                     */
} SMC_Type;


/* ================================================================================ */
/* ================                      UART1                     ================ */
/* ================================================================================ */


/**
  * @brief Universal Asynchronous Receiver Transmitter 1 (UART1)
  */

typedef struct {                                    /*!< UART1 Structure                                                       */
  __O  uint32_t  CR;                                /*!< Control Register                                                      */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  SR;                                /*!< Status Register                                                       */
  __I  uint32_t  RHR;                               /*!< Receive Holding Register                                              */
  __O  uint32_t  THR;                               /*!< Transmit Holding Register                                             */
  __IO uint32_t  BRGR;                              /*!< Baud Rate Generator Register                                          */
  __I  uint32_t  RESERVED[55];
  __IO uint32_t  RPR;                               /*!< Receive Pointer Register                                              */
  __IO uint32_t  RCR;                               /*!< Receive Counter Register                                              */
  __IO uint32_t  TPR;                               /*!< Transmit Pointer Register                                             */
  __IO uint32_t  TCR;                               /*!< Transmit Counter Register                                             */
  __IO uint32_t  RNPR;                              /*!< Receive Next Pointer Register                                         */
  __IO uint32_t  RNCR;                              /*!< Receive Next Counter Register                                         */
  __IO uint32_t  TNPR;                              /*!< Transmit Next Pointer Register                                        */
  __IO uint32_t  TNCR;                              /*!< Transmit Next Counter Register                                        */
  __O  uint32_t  PTCR;                              /*!< Transfer Control Register                                             */
  __I  uint32_t  PTSR;                              /*!< Transfer Status Register                                              */
} UART1_Type;


/* ================================================================================ */
/* ================                      HSMCI                     ================ */
/* ================================================================================ */


/**
  * @brief High Speed MultiMedia Card Interface (HSMCI)
  */

