ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h
typedef struct {                                    /*!< HSMCI Structure                                                       */
  __O  uint32_t  CR;                                /*!< Control Register                                                      */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __IO uint32_t  DTOR;                              /*!< Data Timeout Register                                                 */
  __IO uint32_t  SDCR;                              /*!< SD/SDIO Card Register                                                 */
  __IO uint32_t  ARGR;                              /*!< Argument Register                                                     */
  __O  uint32_t  CMDR;                              /*!< Command Register                                                      */
  __IO uint32_t  BLKR;                              /*!< Block Register                                                        */
  __IO uint32_t  CSTOR;                             /*!< Completion Signal Timeout Register                                    */
  __I  uint32_t  RSPR0;                             /*!< Response Register                                                     */
  __I  uint32_t  RSPR1;                             /*!< Response Register                                                     */
  __I  uint32_t  RSPR2;                             /*!< Response Register                                                     */
  __I  uint32_t  RSPR3;                             /*!< Response Register                                                     */
  __I  uint32_t  RDR;                               /*!< Receive Data Register                                                 */
  __O  uint32_t  TDR;                               /*!< Transmit Data Register                                                */
  __I  uint32_t  RESERVED[2];
  __I  uint32_t  SR;                                /*!< Status Register                                                       */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  CFG;                               /*!< Configuration Register                                                */
  __I  uint32_t  RESERVED2[35];
  __IO uint32_t  WPMR;                              /*!< Write Protection Mode Register                                        */
  __I  uint32_t  WPSR;                              /*!< Write Protection Status Register                                      */
  __I  uint32_t  RESERVED3[5];
  __IO uint32_t  RPR;                               /*!< Receive Pointer Register                                              */
  __IO uint32_t  RCR;                               /*!< Receive Counter Register                                              */
  __IO uint32_t  TPR;                               /*!< Transmit Pointer Register                                             */
  __IO uint32_t  TCR;                               /*!< Transmit Counter Register                                             */
  __IO uint32_t  RNPR;                              /*!< Receive Next Pointer Register                                         */
  __IO uint32_t  RNCR;                              /*!< Receive Next Counter Register                                         */
  __IO uint32_t  TNPR;                              /*!< Transmit Next Pointer Register                                        */
  __IO uint32_t  TNCR;                              /*!< Transmit Next Counter Register                                        */
  __O  uint32_t  PTCR;                              /*!< Transfer Control Register                                             */
  __I  uint32_t  PTSR;                              /*!< Transfer Status Register                                              */
  __I  uint32_t  RESERVED4[54];
  __IO uint32_t  FIFO0;                             /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO1;                             /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO2;                             /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO3;                             /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO4;                             /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO5;                             /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO6;                             /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO7;                             /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO8;                             /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO9;                             /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO10;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO11;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO12;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO13;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO14;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO15;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO16;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO17;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO18;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO19;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO20;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO21;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO22;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO23;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO24;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO25;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO26;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO27;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO28;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO29;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO30;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO31;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO32;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO33;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO34;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO35;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO36;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO37;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO38;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO39;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO40;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO41;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO42;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO43;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO44;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO45;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO46;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO47;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO48;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO49;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO50;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO51;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO52;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO53;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO54;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO55;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO56;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO57;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO58;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO59;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO60;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO61;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO62;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO63;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO64;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO65;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO66;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO67;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO68;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO69;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO70;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO71;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO72;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO73;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO74;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO75;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO76;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO77;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO78;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO79;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO80;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO81;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO82;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO83;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO84;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO85;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO86;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO87;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO88;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO89;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO90;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO91;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO92;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO93;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO94;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO95;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO96;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO97;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO98;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO99;                            /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO100;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO101;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO102;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO103;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO104;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO105;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO106;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO107;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO108;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO109;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO110;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO111;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO112;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO113;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO114;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO115;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO116;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO117;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO118;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO119;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO120;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO121;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO122;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO123;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO124;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO125;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO126;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO127;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO128;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO129;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO130;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO131;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO132;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO133;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO134;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO135;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO136;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO137;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO138;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO139;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO140;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO141;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO142;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO143;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO144;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO145;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO146;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO147;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO148;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO149;                           /*!< FIFO Memory Aperture0                                                 */
