ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h
  __IO uint32_t  FIFO150;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO151;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO152;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO153;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO154;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO155;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO156;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO157;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO158;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO159;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO160;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO161;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO162;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO163;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO164;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO165;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO166;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO167;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO168;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO169;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO170;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO171;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO172;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO173;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO174;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO175;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO176;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO177;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO178;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO179;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO180;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO181;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO182;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO183;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO184;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO185;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO186;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO187;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO188;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO189;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO190;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO191;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO192;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO193;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO194;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO195;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO196;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO197;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO198;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO199;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO200;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO201;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO202;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO203;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO204;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO205;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO206;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO207;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO208;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO209;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO210;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO211;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO212;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO213;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO214;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO215;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO216;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO217;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO218;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO219;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO220;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO221;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO222;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO223;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO224;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO225;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO226;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO227;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO228;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO229;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO230;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO231;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO232;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO233;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO234;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO235;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO236;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO237;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO238;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO239;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO240;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO241;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO242;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO243;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO244;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO245;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO246;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO247;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO248;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO249;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO250;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO251;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO252;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO253;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO254;                           /*!< FIFO Memory Aperture0                                                 */
  __IO uint32_t  FIFO255;                           /*!< FIFO Memory Aperture0                                                 */
} HSMCI_Type;


/* ================================================================================ */
/* ================                       UDP                      ================ */
/* ================================================================================ */


/**
  * @brief USB Device Port (UDP)
  */

typedef struct {                                    /*!< UDP Structure                                                         */
  __I  uint32_t  FRM_NUM;                           /*!< Frame Number Register                                                 */
  __IO uint32_t  GLB_STAT;                          /*!< Global State Register                                                 */
  __IO uint32_t  FADDR;                             /*!< Function Address Register                                             */
  __I  uint32_t  RESERVED;
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  ISR;                               /*!< Interrupt Status Register                                             */
  __O  uint32_t  ICR;                               /*!< Interrupt Clear Register                                              */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  RST_EP;                            /*!< Reset Endpoint Register                                               */
  __I  uint32_t  RESERVED2;
  
  union {
    __IO uint32_t  CSR0_ISOENDPT_ISOENDPT;          /*!< Endpoint Control and Status Register                                  */
    __IO uint32_t  CSR0;                            /*!< Endpoint Control and Status Register                                  */
  };
  __IO uint32_t  CSR1;                              /*!< Endpoint Control and Status Register                                  */
  __IO uint32_t  CSR2;                              /*!< Endpoint Control and Status Register                                  */
  __IO uint32_t  CSR3;                              /*!< Endpoint Control and Status Register                                  */
  __IO uint32_t  CSR4;                              /*!< Endpoint Control and Status Register                                  */
  __IO uint32_t  CSR5;                              /*!< Endpoint Control and Status Register                                  */
  __IO uint32_t  CSR6;                              /*!< Endpoint Control and Status Register                                  */
  __IO uint32_t  CSR7;                              /*!< Endpoint Control and Status Register                                  */
  __IO uint32_t  FDR0;                              /*!< Endpoint FIFO Data Register                                           */
  __IO uint32_t  FDR1;                              /*!< Endpoint FIFO Data Register                                           */
  __IO uint32_t  FDR2;                              /*!< Endpoint FIFO Data Register                                           */
  __IO uint32_t  FDR3;                              /*!< Endpoint FIFO Data Register                                           */
  __IO uint32_t  FDR4;                              /*!< Endpoint FIFO Data Register                                           */
  __IO uint32_t  FDR5;                              /*!< Endpoint FIFO Data Register                                           */
  __IO uint32_t  FDR6;                              /*!< Endpoint FIFO Data Register                                           */
  __IO uint32_t  FDR7;                              /*!< Endpoint FIFO Data Register                                           */
  __I  uint32_t  RESERVED3;
  __IO uint32_t  TXVC;                              /*!< Transceiver Control Register                                          */
} UDP_Type;


/* ================================================================================ */
/* ================                       SPI                      ================ */
/* ================================================================================ */


/**
  * @brief Serial Peripheral Interface (SPI)
  */

typedef struct {                                    /*!< SPI Structure                                                         */
  __O  uint32_t  CR;                                /*!< Control Register                                                      */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __I  uint32_t  RDR;                               /*!< Receive Data Register                                                 */
  __O  uint32_t  TDR;                               /*!< Transmit Data Register                                                */
  __I  uint32_t  SR;                                /*!< Status Register                                                       */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  RESERVED[4];
  __IO uint32_t  CSR0;                              /*!< Chip Select Register                                                  */
  __IO uint32_t  CSR1;                              /*!< Chip Select Register                                                  */
  __IO uint32_t  CSR2;                              /*!< Chip Select Register                                                  */
  __IO uint32_t  CSR3;                              /*!< Chip Select Register                                                  */
  __I  uint32_t  RESERVED1[41];
  __IO uint32_t  WPMR;                              /*!< Write Protection Control Register                                     */
  __I  uint32_t  WPSR;                              /*!< Write Protection Status Register                                      */
  __I  uint32_t  RESERVED2[5];
  __IO uint32_t  RPR;                               /*!< Receive Pointer Register                                              */
  __IO uint32_t  RCR;                               /*!< Receive Counter Register                                              */
  __IO uint32_t  TPR;                               /*!< Transmit Pointer Register                                             */
  __IO uint32_t  TCR;                               /*!< Transmit Counter Register                                             */
  __IO uint32_t  RNPR;                              /*!< Receive Next Pointer Register                                         */
  __IO uint32_t  RNCR;                              /*!< Receive Next Counter Register                                         */
  __IO uint32_t  TNPR;                              /*!< Transmit Next Pointer Register                                        */
  __IO uint32_t  TNCR;                              /*!< Transmit Next Counter Register                                        */
  __O  uint32_t  PTCR;                              /*!< Transfer Control Register                                             */
  __I  uint32_t  PTSR;                              /*!< Transfer Status Register                                              */
} SPI_Type;


/* ================================================================================ */
/* ================                       TC0                      ================ */
/* ================================================================================ */


/**
  * @brief Timer Counter 0 (TC0)
  */

