ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h
typedef struct {                                    /*!< TC0 Structure                                                         */
  __O  uint32_t  CCR0;                              /*!< Channel Control Register (channel = 0)                                */
  
  union {
    __IO uint32_t  CMR0_WAVE_EQ_1_WAVE_EQ_1;        /*!< Channel Mode Register (channel = 0)                                   */
    __IO uint32_t  CMR0;                            /*!< Channel Mode Register (channel = 0)                                   */
  };
  __IO uint32_t  SMMR0;                             /*!< Stepper Motor Mode Register (channel = 0)                             */
  __I  uint32_t  RAB0;                              /*!< Register AB (channel = 0)                                             */
  __I  uint32_t  CV0;                               /*!< Counter Value (channel = 0)                                           */
  __IO uint32_t  RA0;                               /*!< Register A (channel = 0)                                              */
  __IO uint32_t  RB0;                               /*!< Register B (channel = 0)                                              */
  __IO uint32_t  RC0;                               /*!< Register C (channel = 0)                                              */
  __I  uint32_t  SR0;                               /*!< Status Register (channel = 0)                                         */
  __O  uint32_t  IER0;                              /*!< Interrupt Enable Register (channel = 0)                               */
  __O  uint32_t  IDR0;                              /*!< Interrupt Disable Register (channel = 0)                              */
  __I  uint32_t  IMR0;                              /*!< Interrupt Mask Register (channel = 0)                                 */
  __IO uint32_t  EMR0;                              /*!< Extended Mode Register (channel = 0)                                  */
  __I  uint32_t  RESERVED[3];
  __O  uint32_t  CCR1;                              /*!< Channel Control Register (channel = 1)                                */
  
  union {
    __IO uint32_t  CMR1_WAVE_EQ_1_WAVE_EQ_1;        /*!< Channel Mode Register (channel = 1)                                   */
    __IO uint32_t  CMR1;                            /*!< Channel Mode Register (channel = 1)                                   */
  };
  __IO uint32_t  SMMR1;                             /*!< Stepper Motor Mode Register (channel = 1)                             */
  __I  uint32_t  RAB1;                              /*!< Register AB (channel = 1)                                             */
  __I  uint32_t  CV1;                               /*!< Counter Value (channel = 1)                                           */
  __IO uint32_t  RA1;                               /*!< Register A (channel = 1)                                              */
  __IO uint32_t  RB1;                               /*!< Register B (channel = 1)                                              */
  __IO uint32_t  RC1;                               /*!< Register C (channel = 1)                                              */
  __I  uint32_t  SR1;                               /*!< Status Register (channel = 1)                                         */
  __O  uint32_t  IER1;                              /*!< Interrupt Enable Register (channel = 1)                               */
  __O  uint32_t  IDR1;                              /*!< Interrupt Disable Register (channel = 1)                              */
  __I  uint32_t  IMR1;                              /*!< Interrupt Mask Register (channel = 1)                                 */
  __IO uint32_t  EMR1;                              /*!< Extended Mode Register (channel = 1)                                  */
  __I  uint32_t  RESERVED1[3];
  __O  uint32_t  CCR2;                              /*!< Channel Control Register (channel = 2)                                */
  
  union {
    __IO uint32_t  CMR2_WAVE_EQ_1_WAVE_EQ_1;        /*!< Channel Mode Register (channel = 2)                                   */
    __IO uint32_t  CMR2;                            /*!< Channel Mode Register (channel = 2)                                   */
  };
  __IO uint32_t  SMMR2;                             /*!< Stepper Motor Mode Register (channel = 2)                             */
  __I  uint32_t  RAB2;                              /*!< Register AB (channel = 2)                                             */
  __I  uint32_t  CV2;                               /*!< Counter Value (channel = 2)                                           */
  __IO uint32_t  RA2;                               /*!< Register A (channel = 2)                                              */
  __IO uint32_t  RB2;                               /*!< Register B (channel = 2)                                              */
  __IO uint32_t  RC2;                               /*!< Register C (channel = 2)                                              */
  __I  uint32_t  SR2;                               /*!< Status Register (channel = 2)                                         */
  __O  uint32_t  IER2;                              /*!< Interrupt Enable Register (channel = 2)                               */
  __O  uint32_t  IDR2;                              /*!< Interrupt Disable Register (channel = 2)                              */
  __I  uint32_t  IMR2;                              /*!< Interrupt Mask Register (channel = 2)                                 */
  __IO uint32_t  EMR2;                              /*!< Extended Mode Register (channel = 2)                                  */
  __I  uint32_t  RESERVED2[3];
  __O  uint32_t  BCR;                               /*!< Block Control Register                                                */
  __IO uint32_t  BMR;                               /*!< Block Mode Register                                                   */
  __O  uint32_t  QIER;                              /*!< QDEC Interrupt Enable Register                                        */
  __O  uint32_t  QIDR;                              /*!< QDEC Interrupt Disable Register                                       */
  __I  uint32_t  QIMR;                              /*!< QDEC Interrupt Mask Register                                          */
  __I  uint32_t  QISR;                              /*!< QDEC Interrupt Status Register                                        */
  __IO uint32_t  FMR;                               /*!< Fault Mode Register                                                   */
  __I  uint32_t  RESERVED3[2];
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  RESERVED4[6];
  __IO uint32_t  RPR0;                              /*!< Receive Pointer Register (pdc = 0)                                    */
  __IO uint32_t  RCR0;                              /*!< Receive Counter Register (pdc = 0)                                    */
  __I  uint32_t  RESERVED5[2];
  __IO uint32_t  RNPR0;                             /*!< Receive Next Pointer Register (pdc = 0)                               */
  __IO uint32_t  RNCR0;                             /*!< Receive Next Counter Register (pdc = 0)                               */
  __I  uint32_t  RESERVED6[2];
  __O  uint32_t  PTCR0;                             /*!< Transfer Control Register (pdc = 0)                                   */
  __I  uint32_t  PTSR0;                             /*!< Transfer Status Register (pdc = 0)                                    */
  __I  uint32_t  RESERVED7[6];
  __IO uint32_t  RPR1;                              /*!< Receive Pointer Register (pdc = 1)                                    */
  __IO uint32_t  RCR1;                              /*!< Receive Counter Register (pdc = 1)                                    */
  __I  uint32_t  RESERVED8[2];
  __IO uint32_t  RNPR1;                             /*!< Receive Next Pointer Register (pdc = 1)                               */
  __IO uint32_t  RNCR1;                             /*!< Receive Next Counter Register (pdc = 1)                               */
  __I  uint32_t  RESERVED9[2];
  __O  uint32_t  PTCR1;                             /*!< Transfer Control Register (pdc = 1)                                   */
  __I  uint32_t  PTSR1;                             /*!< Transfer Status Register (pdc = 1)                                    */
  __I  uint32_t  RESERVED10[6];
  __IO uint32_t  RPR2;                              /*!< Receive Pointer Register (pdc = 2)                                    */
  __IO uint32_t  RCR2;                              /*!< Receive Counter Register (pdc = 2)                                    */
  __I  uint32_t  RESERVED11[2];
  __IO uint32_t  RNPR2;                             /*!< Receive Next Pointer Register (pdc = 2)                               */
  __IO uint32_t  RNCR2;                             /*!< Receive Next Counter Register (pdc = 2)                               */
  __I  uint32_t  RESERVED12[2];
  __O  uint32_t  PTCR2;                             /*!< Transfer Control Register (pdc = 2)                                   */
  __I  uint32_t  PTSR2;                             /*!< Transfer Status Register (pdc = 2)                                    */
} TC0_Type;


/* ================================================================================ */
/* ================                       TC1                      ================ */
/* ================================================================================ */


/**
  * @brief Timer Counter 1 (TC1)
  */

typedef struct {                                    /*!< TC1 Structure                                                         */
  __O  uint32_t  CCR0;                              /*!< Channel Control Register (channel = 0)                                */
  
  union {
    __IO uint32_t  CMR0_WAVE_EQ_1_WAVE_EQ_1;        /*!< Channel Mode Register (channel = 0)                                   */
    __IO uint32_t  CMR0;                            /*!< Channel Mode Register (channel = 0)                                   */
  };
  __IO uint32_t  SMMR0;                             /*!< Stepper Motor Mode Register (channel = 0)                             */
  __I  uint32_t  RAB0;                              /*!< Register AB (channel = 0)                                             */
  __I  uint32_t  CV0;                               /*!< Counter Value (channel = 0)                                           */
  __IO uint32_t  RA0;                               /*!< Register A (channel = 0)                                              */
  __IO uint32_t  RB0;                               /*!< Register B (channel = 0)                                              */
  __IO uint32_t  RC0;                               /*!< Register C (channel = 0)                                              */
  __I  uint32_t  SR0;                               /*!< Status Register (channel = 0)                                         */
  __O  uint32_t  IER0;                              /*!< Interrupt Enable Register (channel = 0)                               */
  __O  uint32_t  IDR0;                              /*!< Interrupt Disable Register (channel = 0)                              */
  __I  uint32_t  IMR0;                              /*!< Interrupt Mask Register (channel = 0)                                 */
  __IO uint32_t  EMR0;                              /*!< Extended Mode Register (channel = 0)                                  */
  __I  uint32_t  RESERVED[3];
  __O  uint32_t  CCR1;                              /*!< Channel Control Register (channel = 1)                                */
  
  union {
    __IO uint32_t  CMR1_WAVE_EQ_1_WAVE_EQ_1;        /*!< Channel Mode Register (channel = 1)                                   */
    __IO uint32_t  CMR1;                            /*!< Channel Mode Register (channel = 1)                                   */
  };
  __IO uint32_t  SMMR1;                             /*!< Stepper Motor Mode Register (channel = 1)                             */
  __I  uint32_t  RAB1;                              /*!< Register AB (channel = 1)                                             */
  __I  uint32_t  CV1;                               /*!< Counter Value (channel = 1)                                           */
  __IO uint32_t  RA1;                               /*!< Register A (channel = 1)                                              */
  __IO uint32_t  RB1;                               /*!< Register B (channel = 1)                                              */
  __IO uint32_t  RC1;                               /*!< Register C (channel = 1)                                              */
  __I  uint32_t  SR1;                               /*!< Status Register (channel = 1)                                         */
  __O  uint32_t  IER1;                              /*!< Interrupt Enable Register (channel = 1)                               */
  __O  uint32_t  IDR1;                              /*!< Interrupt Disable Register (channel = 1)                              */
  __I  uint32_t  IMR1;                              /*!< Interrupt Mask Register (channel = 1)                                 */
  __IO uint32_t  EMR1;                              /*!< Extended Mode Register (channel = 1)                                  */
  __I  uint32_t  RESERVED1[3];
  __O  uint32_t  CCR2;                              /*!< Channel Control Register (channel = 2)                                */
  
  union {
    __IO uint32_t  CMR2_WAVE_EQ_1_WAVE_EQ_1;        /*!< Channel Mode Register (channel = 2)                                   */
    __IO uint32_t  CMR2;                            /*!< Channel Mode Register (channel = 2)                                   */
  };
  __IO uint32_t  SMMR2;                             /*!< Stepper Motor Mode Register (channel = 2)                             */
  __I  uint32_t  RAB2;                              /*!< Register AB (channel = 2)                                             */
  __I  uint32_t  CV2;                               /*!< Counter Value (channel = 2)                                           */
  __IO uint32_t  RA2;                               /*!< Register A (channel = 2)                                              */
  __IO uint32_t  RB2;                               /*!< Register B (channel = 2)                                              */
  __IO uint32_t  RC2;                               /*!< Register C (channel = 2)                                              */
  __I  uint32_t  SR2;                               /*!< Status Register (channel = 2)                                         */
  __O  uint32_t  IER2;                              /*!< Interrupt Enable Register (channel = 2)                               */
  __O  uint32_t  IDR2;                              /*!< Interrupt Disable Register (channel = 2)                              */
  __I  uint32_t  IMR2;                              /*!< Interrupt Mask Register (channel = 2)                                 */
  __IO uint32_t  EMR2;                              /*!< Extended Mode Register (channel = 2)                                  */
  __I  uint32_t  RESERVED2[3];
  __O  uint32_t  BCR;                               /*!< Block Control Register                                                */
  __IO uint32_t  BMR;                               /*!< Block Mode Register                                                   */
  __O  uint32_t  QIER;                              /*!< QDEC Interrupt Enable Register                                        */
  __O  uint32_t  QIDR;                              /*!< QDEC Interrupt Disable Register                                       */
  __I  uint32_t  QIMR;                              /*!< QDEC Interrupt Mask Register                                          */
  __I  uint32_t  QISR;                              /*!< QDEC Interrupt Status Register                                        */
  __IO uint32_t  FMR;                               /*!< Fault Mode Register                                                   */
  __I  uint32_t  RESERVED3[2];
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  RESERVED4[6];
  __IO uint32_t  RPR0;                              /*!< Receive Pointer Register (pdc = 0)                                    */
  __IO uint32_t  RCR0;                              /*!< Receive Counter Register (pdc = 0)                                    */
  __I  uint32_t  RESERVED5[2];
  __IO uint32_t  RNPR0;                             /*!< Receive Next Pointer Register (pdc = 0)                               */
  __IO uint32_t  RNCR0;                             /*!< Receive Next Counter Register (pdc = 0)                               */
  __I  uint32_t  RESERVED6[2];
  __O  uint32_t  PTCR0;                             /*!< Transfer Control Register (pdc = 0)                                   */
  __I  uint32_t  PTSR0;                             /*!< Transfer Status Register (pdc = 0)                                    */
  __I  uint32_t  RESERVED7[6];
  __IO uint32_t  RPR1;                              /*!< Receive Pointer Register (pdc = 1)                                    */
  __IO uint32_t  RCR1;                              /*!< Receive Counter Register (pdc = 1)                                    */
  __I  uint32_t  RESERVED8[2];
  __IO uint32_t  RNPR1;                             /*!< Receive Next Pointer Register (pdc = 1)                               */
  __IO uint32_t  RNCR1;                             /*!< Receive Next Counter Register (pdc = 1)                               */
  __I  uint32_t  RESERVED9[2];
  __O  uint32_t  PTCR1;                             /*!< Transfer Control Register (pdc = 1)                                   */
  __I  uint32_t  PTSR1;                             /*!< Transfer Status Register (pdc = 1)                                    */
  __I  uint32_t  RESERVED10[6];
  __IO uint32_t  RPR2;                              /*!< Receive Pointer Register (pdc = 2)                                    */
  __IO uint32_t  RCR2;                              /*!< Receive Counter Register (pdc = 2)                                    */
  __I  uint32_t  RESERVED11[2];
  __IO uint32_t  RNPR2;                             /*!< Receive Next Pointer Register (pdc = 2)                               */
  __IO uint32_t  RNCR2;                             /*!< Receive Next Counter Register (pdc = 2)                               */
  __I  uint32_t  RESERVED12[2];
  __O  uint32_t  PTCR2;                             /*!< Transfer Control Register (pdc = 2)                                   */
  __I  uint32_t  PTSR2;                             /*!< Transfer Status Register (pdc = 2)                                    */
} TC1_Type;


/* ================================================================================ */
/* ================                       TC2                      ================ */
/* ================================================================================ */


/**
  * @brief Timer Counter 2 (TC2)
  */

typedef struct {                                    /*!< TC2 Structure                                                         */
  __O  uint32_t  CCR0;                              /*!< Channel Control Register (channel = 0)                                */
  
  union {
    __IO uint32_t  CMR0_WAVE_EQ_1_WAVE_EQ_1;        /*!< Channel Mode Register (channel = 0)                                   */
    __IO uint32_t  CMR0;                            /*!< Channel Mode Register (channel = 0)                                   */
  };
  __IO uint32_t  SMMR0;                             /*!< Stepper Motor Mode Register (channel = 0)                             */
  __I  uint32_t  RAB0;                              /*!< Register AB (channel = 0)                                             */
  __I  uint32_t  CV0;                               /*!< Counter Value (channel = 0)                                           */
  __IO uint32_t  RA0;                               /*!< Register A (channel = 0)                                              */
  __IO uint32_t  RB0;                               /*!< Register B (channel = 0)                                              */
  __IO uint32_t  RC0;                               /*!< Register C (channel = 0)                                              */
  __I  uint32_t  SR0;                               /*!< Status Register (channel = 0)                                         */
  __O  uint32_t  IER0;                              /*!< Interrupt Enable Register (channel = 0)                               */
  __O  uint32_t  IDR0;                              /*!< Interrupt Disable Register (channel = 0)                              */
  __I  uint32_t  IMR0;                              /*!< Interrupt Mask Register (channel = 0)                                 */
  __IO uint32_t  EMR0;                              /*!< Extended Mode Register (channel = 0)                                  */
  __I  uint32_t  RESERVED[3];
  __O  uint32_t  CCR1;                              /*!< Channel Control Register (channel = 1)                                */
  
  union {
    __IO uint32_t  CMR1_WAVE_EQ_1_WAVE_EQ_1;        /*!< Channel Mode Register (channel = 1)                                   */
    __IO uint32_t  CMR1;                            /*!< Channel Mode Register (channel = 1)                                   */
  };
  __IO uint32_t  SMMR1;                             /*!< Stepper Motor Mode Register (channel = 1)                             */
  __I  uint32_t  RAB1;                              /*!< Register AB (channel = 1)                                             */
  __I  uint32_t  CV1;                               /*!< Counter Value (channel = 1)                                           */
  __IO uint32_t  RA1;                               /*!< Register A (channel = 1)                                              */
  __IO uint32_t  RB1;                               /*!< Register B (channel = 1)                                              */
  __IO uint32_t  RC1;                               /*!< Register C (channel = 1)                                              */
  __I  uint32_t  SR1;                               /*!< Status Register (channel = 1)                                         */
  __O  uint32_t  IER1;                              /*!< Interrupt Enable Register (channel = 1)                               */
  __O  uint32_t  IDR1;                              /*!< Interrupt Disable Register (channel = 1)                              */
  __I  uint32_t  IMR1;                              /*!< Interrupt Mask Register (channel = 1)                                 */
  __IO uint32_t  EMR1;                              /*!< Extended Mode Register (channel = 1)                                  */
  __I  uint32_t  RESERVED1[3];
  __O  uint32_t  CCR2;                              /*!< Channel Control Register (channel = 2)                                */
  
