ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h
  union {
    __IO uint32_t  CMR2_WAVE_EQ_1_WAVE_EQ_1;        /*!< Channel Mode Register (channel = 2)                                   */
    __IO uint32_t  CMR2;                            /*!< Channel Mode Register (channel = 2)                                   */
  };
  __IO uint32_t  SMMR2;                             /*!< Stepper Motor Mode Register (channel = 2)                             */
  __I  uint32_t  RAB2;                              /*!< Register AB (channel = 2)                                             */
  __I  uint32_t  CV2;                               /*!< Counter Value (channel = 2)                                           */
  __IO uint32_t  RA2;                               /*!< Register A (channel = 2)                                              */
  __IO uint32_t  RB2;                               /*!< Register B (channel = 2)                                              */
  __IO uint32_t  RC2;                               /*!< Register C (channel = 2)                                              */
  __I  uint32_t  SR2;                               /*!< Status Register (channel = 2)                                         */
  __O  uint32_t  IER2;                              /*!< Interrupt Enable Register (channel = 2)                               */
  __O  uint32_t  IDR2;                              /*!< Interrupt Disable Register (channel = 2)                              */
  __I  uint32_t  IMR2;                              /*!< Interrupt Mask Register (channel = 2)                                 */
  __IO uint32_t  EMR2;                              /*!< Extended Mode Register (channel = 2)                                  */
  __I  uint32_t  RESERVED2[3];
  __O  uint32_t  BCR;                               /*!< Block Control Register                                                */
  __IO uint32_t  BMR;                               /*!< Block Mode Register                                                   */
  __O  uint32_t  QIER;                              /*!< QDEC Interrupt Enable Register                                        */
  __O  uint32_t  QIDR;                              /*!< QDEC Interrupt Disable Register                                       */
  __I  uint32_t  QIMR;                              /*!< QDEC Interrupt Mask Register                                          */
  __I  uint32_t  QISR;                              /*!< QDEC Interrupt Status Register                                        */
  __IO uint32_t  FMR;                               /*!< Fault Mode Register                                                   */
  __I  uint32_t  RESERVED3[2];
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
} TC2_Type;


/* ================================================================================ */
/* ================                     USART0                     ================ */
/* ================================================================================ */


/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter 0 (USART0)
  */

typedef struct {                                    /*!< USART0 Structure                                                      */
  
  union {
    __O  uint32_t  CR_SPI_MODE_SPI_MODE;            /*!< Control Register                                                      */
    __O  uint32_t  CR;                              /*!< Control Register                                                      */
  };
  
  union {
    __IO uint32_t  MR_SPI_MODE_SPI_MODE;            /*!< Mode Register                                                         */
    __IO uint32_t  MR;                              /*!< Mode Register                                                         */
  };
  
  union {
    __O  uint32_t  IER_SPI_MODE_SPI_MODE;           /*!< Interrupt Enable Register                                             */
    __O  uint32_t  IER;                             /*!< Interrupt Enable Register                                             */
  };
  
  union {
    __O  uint32_t  IDR_SPI_MODE_SPI_MODE;           /*!< Interrupt Disable Register                                            */
    __O  uint32_t  IDR;                             /*!< Interrupt Disable Register                                            */
  };
  
  union {
    __I  uint32_t  IMR_SPI_MODE_SPI_MODE;           /*!< Interrupt Mask Register                                               */
    __I  uint32_t  IMR;                             /*!< Interrupt Mask Register                                               */
  };
  
  union {
    __I  uint32_t  CSR_SPI_MODE_SPI_MODE;           /*!< Channel Status Register                                               */
    __I  uint32_t  CSR;                             /*!< Channel Status Register                                               */
  };
  __I  uint32_t  RHR;                               /*!< Receiver Holding Register                                             */
  __O  uint32_t  THR;                               /*!< Transmitter Holding Register                                          */
  __IO uint32_t  BRGR;                              /*!< Baud Rate Generator Register                                          */
  __IO uint32_t  RTOR;                              /*!< Receiver Time-out Register                                            */
  __IO uint32_t  TTGR;                              /*!< Transmitter Timeguard Register                                        */
  __I  uint32_t  RESERVED[5];
  __IO uint32_t  FIDI;                              /*!< FI DI Ratio Register                                                  */
  __I  uint32_t  NER;                               /*!< Number of Errors Register                                             */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  IF;                                /*!< IrDA Filter Register                                                  */
  __IO uint32_t  MAN;                               /*!< Manchester Encoder Decoder Register                                   */
  __I  uint32_t  RESERVED2[36];
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  WPSR;                              /*!< Write Protect Status Register                                         */
  __I  uint32_t  RESERVED3[5];
  __IO uint32_t  RPR;                               /*!< Receive Pointer Register                                              */
  __IO uint32_t  RCR;                               /*!< Receive Counter Register                                              */
  __IO uint32_t  TPR;                               /*!< Transmit Pointer Register                                             */
  __IO uint32_t  TCR;                               /*!< Transmit Counter Register                                             */
  __IO uint32_t  RNPR;                              /*!< Receive Next Pointer Register                                         */
  __IO uint32_t  RNCR;                              /*!< Receive Next Counter Register                                         */
  __IO uint32_t  TNPR;                              /*!< Transmit Next Pointer Register                                        */
  __IO uint32_t  TNCR;                              /*!< Transmit Next Counter Register                                        */
  __O  uint32_t  PTCR;                              /*!< Transfer Control Register                                             */
  __I  uint32_t  PTSR;                              /*!< Transfer Status Register                                              */
} USART0_Type;


/* ================================================================================ */
/* ================                     USART1                     ================ */
/* ================================================================================ */


/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter 1 (USART1)
  */

