ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h
typedef struct {                                    /*!< USART1 Structure                                                      */
  
  union {
    __O  uint32_t  CR_SPI_MODE_SPI_MODE;            /*!< Control Register                                                      */
    __O  uint32_t  CR;                              /*!< Control Register                                                      */
  };
  
  union {
    __IO uint32_t  MR_SPI_MODE_SPI_MODE;            /*!< Mode Register                                                         */
    __IO uint32_t  MR;                              /*!< Mode Register                                                         */
  };
  
  union {
    __O  uint32_t  IER_SPI_MODE_SPI_MODE;           /*!< Interrupt Enable Register                                             */
    __O  uint32_t  IER;                             /*!< Interrupt Enable Register                                             */
  };
  
  union {
    __O  uint32_t  IDR_SPI_MODE_SPI_MODE;           /*!< Interrupt Disable Register                                            */
    __O  uint32_t  IDR;                             /*!< Interrupt Disable Register                                            */
  };
  
  union {
    __I  uint32_t  IMR_SPI_MODE_SPI_MODE;           /*!< Interrupt Mask Register                                               */
    __I  uint32_t  IMR;                             /*!< Interrupt Mask Register                                               */
  };
  
  union {
    __I  uint32_t  CSR_SPI_MODE_SPI_MODE;           /*!< Channel Status Register                                               */
    __I  uint32_t  CSR;                             /*!< Channel Status Register                                               */
  };
  __I  uint32_t  RHR;                               /*!< Receiver Holding Register                                             */
  __O  uint32_t  THR;                               /*!< Transmitter Holding Register                                          */
  __IO uint32_t  BRGR;                              /*!< Baud Rate Generator Register                                          */
  __IO uint32_t  RTOR;                              /*!< Receiver Time-out Register                                            */
  __IO uint32_t  TTGR;                              /*!< Transmitter Timeguard Register                                        */
  __I  uint32_t  RESERVED[5];
  __IO uint32_t  FIDI;                              /*!< FI DI Ratio Register                                                  */
  __I  uint32_t  NER;                               /*!< Number of Errors Register                                             */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  IF;                                /*!< IrDA Filter Register                                                  */
  __IO uint32_t  MAN;                               /*!< Manchester Encoder Decoder Register                                   */
  __I  uint32_t  RESERVED2[36];
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  WPSR;                              /*!< Write Protect Status Register                                         */
  __I  uint32_t  RESERVED3[5];
  __IO uint32_t  RPR;                               /*!< Receive Pointer Register                                              */
  __IO uint32_t  RCR;                               /*!< Receive Counter Register                                              */
  __IO uint32_t  TPR;                               /*!< Transmit Pointer Register                                             */
  __IO uint32_t  TCR;                               /*!< Transmit Counter Register                                             */
  __IO uint32_t  RNPR;                              /*!< Receive Next Pointer Register                                         */
  __IO uint32_t  RNCR;                              /*!< Receive Next Counter Register                                         */
  __IO uint32_t  TNPR;                              /*!< Transmit Next Pointer Register                                        */
  __IO uint32_t  TNCR;                              /*!< Transmit Next Counter Register                                        */
  __O  uint32_t  PTCR;                              /*!< Transfer Control Register                                             */
  __I  uint32_t  PTSR;                              /*!< Transfer Status Register                                              */
} USART1_Type;


/* ================================================================================ */
/* ================                      TWI0                      ================ */
/* ================================================================================ */


/**
  * @brief Two-wire Interface 0 (TWI0)
  */

typedef struct {                                    /*!< TWI0 Structure                                                        */
  __O  uint32_t  CR;                                /*!< Control Register                                                      */
  __IO uint32_t  MMR;                               /*!< Master Mode Register                                                  */
  __IO uint32_t  SMR;                               /*!< Slave Mode Register                                                   */
  __IO uint32_t  IADR;                              /*!< Internal Address Register                                             */
  __IO uint32_t  CWGR;                              /*!< Clock Waveform Generator Register                                     */
  __I  uint32_t  RESERVED[3];
  __I  uint32_t  SR;                                /*!< Status Register                                                       */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  RHR;                               /*!< Receive Holding Register                                              */
  __O  uint32_t  THR;                               /*!< Transmit Holding Register                                             */
  __I  uint32_t  RESERVED1[43];
  __IO uint32_t  WPROT_MODE;                        /*!< Protection Mode Register                                              */
  __I  uint32_t  WPROT_STATUS;                      /*!< Protection Status Register                                            */
  __I  uint32_t  RESERVED2[5];
  __IO uint32_t  RPR;                               /*!< Receive Pointer Register                                              */
  __IO uint32_t  RCR;                               /*!< Receive Counter Register                                              */
  __IO uint32_t  TPR;                               /*!< Transmit Pointer Register                                             */
  __IO uint32_t  TCR;                               /*!< Transmit Counter Register                                             */
  __IO uint32_t  RNPR;                              /*!< Receive Next Pointer Register                                         */
  __IO uint32_t  RNCR;                              /*!< Receive Next Counter Register                                         */
  __IO uint32_t  TNPR;                              /*!< Transmit Next Pointer Register                                        */
  __IO uint32_t  TNCR;                              /*!< Transmit Next Counter Register                                        */
  __O  uint32_t  PTCR;                              /*!< Transfer Control Register                                             */
  __I  uint32_t  PTSR;                              /*!< Transfer Status Register                                              */
} TWI0_Type;


/* ================================================================================ */
/* ================                      TWI1                      ================ */
/* ================================================================================ */


/**
  * @brief Two-wire Interface 1 (TWI1)
  */

typedef struct {                                    /*!< TWI1 Structure                                                        */
  __O  uint32_t  CR;                                /*!< Control Register                                                      */
  __IO uint32_t  MMR;                               /*!< Master Mode Register                                                  */
  __IO uint32_t  SMR;                               /*!< Slave Mode Register                                                   */
  __IO uint32_t  IADR;                              /*!< Internal Address Register                                             */
  __IO uint32_t  CWGR;                              /*!< Clock Waveform Generator Register                                     */
  __I  uint32_t  RESERVED[3];
  __I  uint32_t  SR;                                /*!< Status Register                                                       */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  RHR;                               /*!< Receive Holding Register                                              */
  __O  uint32_t  THR;                               /*!< Transmit Holding Register                                             */
  __I  uint32_t  RESERVED1[43];
  __IO uint32_t  WPROT_MODE;                        /*!< Protection Mode Register                                              */
  __I  uint32_t  WPROT_STATUS;                      /*!< Protection Status Register                                            */
  __I  uint32_t  RESERVED2[5];
  __IO uint32_t  RPR;                               /*!< Receive Pointer Register                                              */
  __IO uint32_t  RCR;                               /*!< Receive Counter Register                                              */
  __IO uint32_t  TPR;                               /*!< Transmit Pointer Register                                             */
  __IO uint32_t  TCR;                               /*!< Transmit Counter Register                                             */
  __IO uint32_t  RNPR;                              /*!< Receive Next Pointer Register                                         */
  __IO uint32_t  RNCR;                              /*!< Receive Next Counter Register                                         */
  __IO uint32_t  TNPR;                              /*!< Transmit Next Pointer Register                                        */
  __IO uint32_t  TNCR;                              /*!< Transmit Next Counter Register                                        */
  __O  uint32_t  PTCR;                              /*!< Transfer Control Register                                             */
  __I  uint32_t  PTSR;                              /*!< Transfer Status Register                                              */
} TWI1_Type;


/* ================================================================================ */
/* ================                      AFEC0                     ================ */
/* ================================================================================ */


/**
  * @brief Analog-Front-End Controller 0 (AFEC0)
  */

typedef struct {                                    /*!< AFEC0 Structure                                                       */
  __O  uint32_t  CR;                                /*!< Control Register                                                      */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __IO uint32_t  EMR;                               /*!< Extended Mode Register                                                */
  __IO uint32_t  SEQ1R;                             /*!< Channel Sequence 1 Register                                           */
  __IO uint32_t  SEQ2R;                             /*!< Channel Sequence 2 Register                                           */
  __O  uint32_t  CHER;                              /*!< Channel Enable Register                                               */
  __O  uint32_t  CHDR;                              /*!< Channel Disable Register                                              */
  __I  uint32_t  CHSR;                              /*!< Channel Status Register                                               */
  __I  uint32_t  LCDR;                              /*!< Last Converted Data Register                                          */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  ISR;                               /*!< Interrupt Status Register                                             */
  __I  uint32_t  RESERVED[6];
  __I  uint32_t  OVER;                              /*!< Overrun Status Register                                               */
  __IO uint32_t  CWR;                               /*!< Compare Window Register                                               */
  __IO uint32_t  CGR;                               /*!< Channel Gain Register                                                 */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  CDOR;                              /*!< Channel DC Offset Register                                            */
  __IO uint32_t  DIFFR;                             /*!< Channel Differential Register                                         */
  __I  uint32_t  CSELR;                             /*!< Channel Register Selection                                            */
  __I  uint32_t  CDR;                               /*!< Channel Data Register                                                 */
  __I  uint32_t  COCR;                              /*!< Channel Offset Compensation Register                                  */
  __IO uint32_t  TEMPMR;                            /*!< Temperature Sensor Mode Register                                      */
  __IO uint32_t  TEMPCWR;                           /*!< Temperature Compare Window Register                                   */
  __I  uint32_t  RESERVED2[7];
  __IO uint32_t  ACR;                               /*!< Analog Control Register                                               */
  __I  uint32_t  RESERVED3[19];
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  WPSR;                              /*!< Write Protect Status Register                                         */
  __I  uint32_t  RESERVED4[5];
  __IO uint32_t  RPR;                               /*!< Receive Pointer Register                                              */
  __IO uint32_t  RCR;                               /*!< Receive Counter Register                                              */
  __I  uint32_t  RESERVED5[2];
  __IO uint32_t  RNPR;                              /*!< Receive Next Pointer Register                                         */
  __IO uint32_t  RNCR;                              /*!< Receive Next Counter Register                                         */
  __I  uint32_t  RESERVED6[2];
  __O  uint32_t  PTCR;                              /*!< Transfer Control Register                                             */
  __I  uint32_t  PTSR;                              /*!< Transfer Status Register                                              */
} AFEC0_Type;


/* ================================================================================ */
/* ================                      AFEC1                     ================ */
/* ================================================================================ */


/**
  * @brief Analog-Front-End Controller 1 (AFEC1)
  */

typedef struct {                                    /*!< AFEC1 Structure                                                       */
  __O  uint32_t  CR;                                /*!< Control Register                                                      */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __IO uint32_t  EMR;                               /*!< Extended Mode Register                                                */
  __IO uint32_t  SEQ1R;                             /*!< Channel Sequence 1 Register                                           */
  __IO uint32_t  SEQ2R;                             /*!< Channel Sequence 2 Register                                           */
  __O  uint32_t  CHER;                              /*!< Channel Enable Register                                               */
  __O  uint32_t  CHDR;                              /*!< Channel Disable Register                                              */
  __I  uint32_t  CHSR;                              /*!< Channel Status Register                                               */
  __I  uint32_t  LCDR;                              /*!< Last Converted Data Register                                          */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  ISR;                               /*!< Interrupt Status Register                                             */
  __I  uint32_t  RESERVED[6];
  __I  uint32_t  OVER;                              /*!< Overrun Status Register                                               */
  __IO uint32_t  CWR;                               /*!< Compare Window Register                                               */
  __IO uint32_t  CGR;                               /*!< Channel Gain Register                                                 */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  CDOR;                              /*!< Channel DC Offset Register                                            */
  __IO uint32_t  DIFFR;                             /*!< Channel Differential Register                                         */
  __I  uint32_t  CSELR;                             /*!< Channel Register Selection                                            */
  __I  uint32_t  CDR;                               /*!< Channel Data Register                                                 */
  __I  uint32_t  COCR;                              /*!< Channel Offset Compensation Register                                  */
  __IO uint32_t  TEMPMR;                            /*!< Temperature Sensor Mode Register                                      */
  __IO uint32_t  TEMPCWR;                           /*!< Temperature Compare Window Register                                   */
  __I  uint32_t  RESERVED2[7];
  __IO uint32_t  ACR;                               /*!< Analog Control Register                                               */
  __I  uint32_t  RESERVED3[19];
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  WPSR;                              /*!< Write Protect Status Register                                         */
  __I  uint32_t  RESERVED4[5];
  __IO uint32_t  RPR;                               /*!< Receive Pointer Register                                              */
  __IO uint32_t  RCR;                               /*!< Receive Counter Register                                              */
  __I  uint32_t  RESERVED5[2];
  __IO uint32_t  RNPR;                              /*!< Receive Next Pointer Register                                         */
  __IO uint32_t  RNCR;                              /*!< Receive Next Counter Register                                         */
  __I  uint32_t  RESERVED6[2];
  __O  uint32_t  PTCR;                              /*!< Transfer Control Register                                             */
  __I  uint32_t  PTSR;                              /*!< Transfer Status Register                                              */
} AFEC1_Type;


/* ================================================================================ */
/* ================                      DACC                      ================ */
/* ================================================================================ */


/**
  * @brief Digital-to-Analog Converter Controller (DACC)
  */

