ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h
typedef struct {                                    /*!< DACC Structure                                                        */
  __O  uint32_t  CR;                                /*!< Control Register                                                      */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __I  uint32_t  RESERVED[2];
  __O  uint32_t  CHER;                              /*!< Channel Enable Register                                               */
  __O  uint32_t  CHDR;                              /*!< Channel Disable Register                                              */
  __I  uint32_t  CHSR;                              /*!< Channel Status Register                                               */
  __I  uint32_t  RESERVED1;
  __O  uint32_t  CDR;                               /*!< Conversion Data Register                                              */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  ISR;                               /*!< Interrupt Status Register                                             */
  __I  uint32_t  RESERVED2[24];
  __IO uint32_t  ACR;                               /*!< Analog Current Register                                               */
  __I  uint32_t  RESERVED3[19];
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode register                                           */
  __I  uint32_t  WPSR;                              /*!< Write Protect Status register                                         */
  __I  uint32_t  RESERVED4[7];
  __IO uint32_t  TPR;                               /*!< Transmit Pointer Register                                             */
  __IO uint32_t  TCR;                               /*!< Transmit Counter Register                                             */
  __I  uint32_t  RESERVED5[2];
  __IO uint32_t  TNPR;                              /*!< Transmit Next Pointer Register                                        */
  __IO uint32_t  TNCR;                              /*!< Transmit Next Counter Register                                        */
  __O  uint32_t  PTCR;                              /*!< Transfer Control Register                                             */
  __I  uint32_t  PTSR;                              /*!< Transfer Status Register                                              */
} DACC_Type;


/* ================================================================================ */
/* ================                       ACC                      ================ */
/* ================================================================================ */


/**
  * @brief Analog Comparator Controller (ACC)
  */

typedef struct {                                    /*!< ACC Structure                                                         */
  __O  uint32_t  CR;                                /*!< Control Register                                                      */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __I  uint32_t  RESERVED[7];
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  ISR;                               /*!< Interrupt Status Register                                             */
  __I  uint32_t  RESERVED1[24];
  __IO uint32_t  ACR;                               /*!< Analog Control Register                                               */
  __I  uint32_t  RESERVED2[19];
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  WPSR;                              /*!< Write Protect Status Register                                         */
} ACC_Type;


/* ================================================================================ */
/* ================                      DMAC                      ================ */
/* ================================================================================ */


/**
  * @brief DMA Controller (DMAC)
  */

typedef struct {                                    /*!< DMAC Structure                                                        */
  __IO uint32_t  GCFG;                              /*!< DMAC Global Configuration Register                                    */
  __IO uint32_t  EN;                                /*!< DMAC Enable Register                                                  */
  __IO uint32_t  SREQ;                              /*!< DMAC Software Single Request Register                                 */
  __IO uint32_t  CREQ;                              /*!< DMAC Software Chunk Transfer Request Register                         */
  __IO uint32_t  LAST;                              /*!< DMAC Software Last Transfer Flag Register                             */
  __I  uint32_t  RESERVED;
  __O  uint32_t  EBCIER;                            /*!< DMAC Error, Chained Buffer Transfer Completed Interrupt and
                                                         Buffer Transfer Completed Interrupt Enable register.                  */
  __O  uint32_t  EBCIDR;                            /*!< DMAC Error, Chained Buffer Transfer Completed Interrupt and
                                                         Buffer Transfer Completed Interrupt Disable register.                 */
  __I  uint32_t  EBCIMR;                            /*!< DMAC Error, Chained Buffer Transfer Completed Interrupt and
                                                         Buffer transfer completed Mask Register.                              */
  __I  uint32_t  EBCISR;                            /*!< DMAC Error, Chained Buffer Transfer Completed Interrupt and
                                                         Buffer transfer completed Status Register.                            */
  __O  uint32_t  CHER;                              /*!< DMAC Channel Handler Enable Register                                  */
  __O  uint32_t  CHDR;                              /*!< DMAC Channel Handler Disable Register                                 */
  __I  uint32_t  CHSR;                              /*!< DMAC Channel Handler Status Register                                  */
  __I  uint32_t  RESERVED1[2];
  __IO uint32_t  SADDR0;                            /*!< DMAC Channel Source Address Register (ch_num = 0)                     */
  __IO uint32_t  DADDR0;                            /*!< DMAC Channel Destination Address Register (ch_num = 0)                */
  __IO uint32_t  DSCR0;                             /*!< DMAC Channel Descriptor Address Register (ch_num = 0)                 */
  __IO uint32_t  CTRLA0;                            /*!< DMAC Channel Control A Register (ch_num = 0)                          */
  __IO uint32_t  CTRLB0;                            /*!< DMAC Channel Control B Register (ch_num = 0)                          */
  __IO uint32_t  CFG0;                              /*!< DMAC Channel Configuration Register (ch_num = 0)                      */
  __I  uint32_t  RESERVED2[4];
  __IO uint32_t  SADDR1;                            /*!< DMAC Channel Source Address Register (ch_num = 1)                     */
  __IO uint32_t  DADDR1;                            /*!< DMAC Channel Destination Address Register (ch_num = 1)                */
  __IO uint32_t  DSCR1;                             /*!< DMAC Channel Descriptor Address Register (ch_num = 1)                 */
  __IO uint32_t  CTRLA1;                            /*!< DMAC Channel Control A Register (ch_num = 1)                          */
  __IO uint32_t  CTRLB1;                            /*!< DMAC Channel Control B Register (ch_num = 1)                          */
  __IO uint32_t  CFG1;                              /*!< DMAC Channel Configuration Register (ch_num = 1)                      */
  __I  uint32_t  RESERVED3[4];
  __IO uint32_t  SADDR2;                            /*!< DMAC Channel Source Address Register (ch_num = 2)                     */
  __IO uint32_t  DADDR2;                            /*!< DMAC Channel Destination Address Register (ch_num = 2)                */
  __IO uint32_t  DSCR2;                             /*!< DMAC Channel Descriptor Address Register (ch_num = 2)                 */
  __IO uint32_t  CTRLA2;                            /*!< DMAC Channel Control A Register (ch_num = 2)                          */
  __IO uint32_t  CTRLB2;                            /*!< DMAC Channel Control B Register (ch_num = 2)                          */
  __IO uint32_t  CFG2;                              /*!< DMAC Channel Configuration Register (ch_num = 2)                      */
  __I  uint32_t  RESERVED4[4];
  __IO uint32_t  SADDR3;                            /*!< DMAC Channel Source Address Register (ch_num = 3)                     */
  __IO uint32_t  DADDR3;                            /*!< DMAC Channel Destination Address Register (ch_num = 3)                */
  __IO uint32_t  DSCR3;                             /*!< DMAC Channel Descriptor Address Register (ch_num = 3)                 */
  __IO uint32_t  CTRLA3;                            /*!< DMAC Channel Control A Register (ch_num = 3)                          */
  __IO uint32_t  CTRLB3;                            /*!< DMAC Channel Control B Register (ch_num = 3)                          */
  __IO uint32_t  CFG3;                              /*!< DMAC Channel Configuration Register (ch_num = 3)                      */
  __I  uint32_t  RESERVED5[70];
  __IO uint32_t  WPMR;                              /*!< DMAC Write Protect Mode Register                                      */
  __I  uint32_t  WPSR;                              /*!< DMAC Write Protect Status Register                                    */
} DMAC_Type;


/* ================================================================================ */
/* ================                      CMCC                      ================ */
/* ================================================================================ */


/**
  * @brief Cortex M Cache Controller (CMCC)
  */

typedef struct {                                    /*!< CMCC Structure                                                        */
  __I  uint32_t  TYPE;                              /*!< Cache Type Register                                                   */
  __IO uint32_t  CFG;                               /*!< Cache Configuration Register                                          */
  __O  uint32_t  CTRL;                              /*!< Cache Control Register                                                */
  __I  uint32_t  SR;                                /*!< Cache Status Register                                                 */
  __I  uint32_t  RESERVED[4];
  __O  uint32_t  MAINT0;                            /*!< Cache Maintenance Register 0                                          */
  __O  uint32_t  MAINT1;                            /*!< Cache Maintenance Register 1                                          */
  __IO uint32_t  MCFG;                              /*!< Cache Monitor Configuration Register                                  */
  __IO uint32_t  MEN;                               /*!< Cache Monitor Enable Register                                         */
  __O  uint32_t  MCTRL;                             /*!< Cache Monitor Control Register                                        */
  __I  uint32_t  MSR;                               /*!< Cache Monitor Status Register                                         */
} CMCC_Type;


/* ================================================================================ */
/* ================                     MATRIX                     ================ */
/* ================================================================================ */


/**
  * @brief AHB Bus Matrix (MATRIX)
  */

typedef struct {                                    /*!< MATRIX Structure                                                      */
  __IO uint32_t  MCFG0;                             /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG1;                             /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG2;                             /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG3;                             /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG4;                             /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG5;                             /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG6;                             /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG7;                             /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG8;                             /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG9;                             /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG10;                            /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG11;                            /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG12;                            /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG13;                            /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG14;                            /*!< Master Configuration Register                                         */
  __IO uint32_t  MCFG15;                            /*!< Master Configuration Register                                         */
  __IO uint32_t  SCFG0;                             /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG1;                             /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG2;                             /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG3;                             /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG4;                             /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG5;                             /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG6;                             /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG7;                             /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG8;                             /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG9;                             /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG10;                            /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG11;                            /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG12;                            /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG13;                            /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG14;                            /*!< Slave Configuration Register                                          */
  __IO uint32_t  SCFG15;                            /*!< Slave Configuration Register                                          */
  __IO uint32_t  PRAS0;                             /*!< Priority Register A for Slave 0                                       */
  __IO uint32_t  PRBS0;                             /*!< Priority Register B for Slave 0                                       */
  __IO uint32_t  PRAS1;                             /*!< Priority Register A for Slave 1                                       */
  __IO uint32_t  PRBS1;                             /*!< Priority Register B for Slave 1                                       */
  __IO uint32_t  PRAS2;                             /*!< Priority Register A for Slave 2                                       */
  __IO uint32_t  PRBS2;                             /*!< Priority Register B for Slave 2                                       */
  __IO uint32_t  PRAS3;                             /*!< Priority Register A for Slave 3                                       */
  __IO uint32_t  PRBS3;                             /*!< Priority Register B for Slave 3                                       */
  __IO uint32_t  PRAS4;                             /*!< Priority Register A for Slave 4                                       */
  __IO uint32_t  PRBS4;                             /*!< Priority Register B for Slave 4                                       */
  __IO uint32_t  PRAS5;                             /*!< Priority Register A for Slave 5                                       */
  __IO uint32_t  PRBS5;                             /*!< Priority Register B for Slave 5                                       */
  __IO uint32_t  PRAS6;                             /*!< Priority Register A for Slave 6                                       */
  __IO uint32_t  PRBS6;                             /*!< Priority Register B for Slave 6                                       */
  __IO uint32_t  PRAS7;                             /*!< Priority Register A for Slave 7                                       */
  __IO uint32_t  PRBS7;                             /*!< Priority Register B for Slave 7                                       */
  __IO uint32_t  PRAS8;                             /*!< Priority Register A for Slave 8                                       */
  __IO uint32_t  PRBS8;                             /*!< Priority Register B for Slave 8                                       */
  __IO uint32_t  PRAS9;                             /*!< Priority Register A for Slave 9                                       */
  __IO uint32_t  PRBS9;                             /*!< Priority Register B for Slave 9                                       */
  __IO uint32_t  PRAS10;                            /*!< Priority Register A for Slave 10                                      */
  __IO uint32_t  PRBS10;                            /*!< Priority Register B for Slave 10                                      */
  __IO uint32_t  PRAS11;                            /*!< Priority Register A for Slave 11                                      */
  __IO uint32_t  PRBS11;                            /*!< Priority Register B for Slave 11                                      */
  __IO uint32_t  PRAS12;                            /*!< Priority Register A for Slave 12                                      */
  __IO uint32_t  PRBS12;                            /*!< Priority Register B for Slave 12                                      */
  __IO uint32_t  PRAS13;                            /*!< Priority Register A for Slave 13                                      */
  __IO uint32_t  PRBS13;                            /*!< Priority Register B for Slave 13                                      */
  __IO uint32_t  PRAS14;                            /*!< Priority Register A for Slave 14                                      */
  __IO uint32_t  PRBS14;                            /*!< Priority Register B for Slave 14                                      */
  __IO uint32_t  PRAS15;                            /*!< Priority Register A for Slave 15                                      */
  __IO uint32_t  PRBS15;                            /*!< Priority Register B for Slave 15                                      */
  __IO uint32_t  MRCR;                              /*!< Master Remap Control Register                                         */
  __I  uint32_t  RESERVED[3];
  __IO uint32_t  SFR0;                              /*!< Special Function Register                                             */
  __IO uint32_t  SFR1;                              /*!< Special Function Register                                             */
  __IO uint32_t  SFR2;                              /*!< Special Function Register                                             */
  __IO uint32_t  SFR3;                              /*!< Special Function Register                                             */
  __IO uint32_t  SFR4;                              /*!< Special Function Register                                             */
  __IO uint32_t  SFR5;                              /*!< Special Function Register                                             */
  __IO uint32_t  SFR6;                              /*!< Special Function Register                                             */
  __IO uint32_t  SFR7;                              /*!< Special Function Register                                             */
  __IO uint32_t  SFR8;                              /*!< Special Function Register                                             */
  __IO uint32_t  SFR9;                              /*!< Special Function Register                                             */
  __IO uint32_t  SFR10;                             /*!< Special Function Register                                             */
  __IO uint32_t  SFR11;                             /*!< Special Function Register                                             */
  __IO uint32_t  SFR12;                             /*!< Special Function Register                                             */
  __IO uint32_t  SFR13;                             /*!< Special Function Register                                             */
  __IO uint32_t  SFR14;                             /*!< Special Function Register                                             */
  __IO uint32_t  SFR15;                             /*!< Special Function Register                                             */
  __I  uint32_t  RESERVED1[37];
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  WPSR;                              /*!< Write Protect Status Register                                         */
} MATRIX_Type;


