ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h
/* ================================================================================ */
/* ================                       PMC                      ================ */
/* ================================================================================ */


/**
  * @brief Power Management Controller (PMC)
  */

typedef struct {                                    /*!< PMC Structure                                                         */
  __O  uint32_t  PMC_SCER;                          /*!< System Clock Enable Register                                          */
  __O  uint32_t  PMC_SCDR;                          /*!< System Clock Disable Register                                         */
  __I  uint32_t  PMC_SCSR;                          /*!< System Clock Status Register                                          */
  __I  uint32_t  RESERVED;
  __O  uint32_t  PMC_PCER0;                         /*!< Peripheral Clock Enable Register 0                                    */
  __O  uint32_t  PMC_PCDR0;                         /*!< Peripheral Clock Disable Register 0                                   */
  __I  uint32_t  PMC_PCSR0;                         /*!< Peripheral Clock Status Register 0                                    */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  CKGR_MOR;                          /*!< Main Oscillator Register                                              */
  __IO uint32_t  CKGR_MCFR;                         /*!< Main Clock Frequency Register                                         */
  __IO uint32_t  CKGR_PLLAR;                        /*!< PLLA Register                                                         */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  PMC_MCKR;                          /*!< Master Clock Register                                                 */
  __I  uint32_t  RESERVED3;
  __IO uint32_t  PMC_USB;                           /*!< USB Clock Register                                                    */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  PMC_PCK0;                          /*!< Programmable Clock 0 Register                                         */
  __IO uint32_t  PMC_PCK1;                          /*!< Programmable Clock 0 Register                                         */
  __IO uint32_t  PMC_PCK2;                          /*!< Programmable Clock 0 Register                                         */
  __I  uint32_t  RESERVED5[5];
  __O  uint32_t  PMC_IER;                           /*!< Interrupt Enable Register                                             */
  __O  uint32_t  PMC_IDR;                           /*!< Interrupt Disable Register                                            */
  __I  uint32_t  PMC_SR;                            /*!< Status Register                                                       */
  __I  uint32_t  PMC_IMR;                           /*!< Interrupt Mask Register                                               */
  __IO uint32_t  PMC_FSMR;                          /*!< Fast Startup Mode Register                                            */
  __IO uint32_t  PMC_FSPR;                          /*!< Fast Startup Polarity Register                                        */
  __O  uint32_t  PMC_FOCR;                          /*!< Fault Output Clear Register                                           */
  __I  uint32_t  RESERVED6[26];
  __IO uint32_t  PMC_WPMR;                          /*!< Write Protect Mode Register                                           */
  __I  uint32_t  PMC_WPSR;                          /*!< Write Protect Status Register                                         */
  __I  uint32_t  RESERVED7[5];
  __O  uint32_t  PMC_PCER1;                         /*!< Peripheral Clock Enable Register 1                                    */
  __O  uint32_t  PMC_PCDR1;                         /*!< Peripheral Clock Disable Register 1                                   */
  __I  uint32_t  PMC_PCSR1;                         /*!< Peripheral Clock Status Register 1                                    */
  __I  uint32_t  RESERVED8;
  __IO uint32_t  PMC_OCR;                           /*!< Oscillator Calibration Register                                       */
} PMC_Type;


/* ================================================================================ */
/* ================                      UART0                     ================ */
/* ================================================================================ */


/**
  * @brief Universal Asynchronous Receiver Transmitter 0 (UART0)
  */

typedef struct {                                    /*!< UART0 Structure                                                       */
  __O  uint32_t  CR;                                /*!< Control Register                                                      */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  SR;                                /*!< Status Register                                                       */
  __I  uint32_t  RHR;                               /*!< Receive Holding Register                                              */
  __O  uint32_t  THR;                               /*!< Transmit Holding Register                                             */
  __IO uint32_t  BRGR;                              /*!< Baud Rate Generator Register                                          */
  __I  uint32_t  RESERVED[55];
  __IO uint32_t  RPR;                               /*!< Receive Pointer Register                                              */
  __IO uint32_t  RCR;                               /*!< Receive Counter Register                                              */
  __IO uint32_t  TPR;                               /*!< Transmit Pointer Register                                             */
  __IO uint32_t  TCR;                               /*!< Transmit Counter Register                                             */
  __IO uint32_t  RNPR;                              /*!< Receive Next Pointer Register                                         */
  __IO uint32_t  RNCR;                              /*!< Receive Next Counter Register                                         */
  __IO uint32_t  TNPR;                              /*!< Transmit Next Pointer Register                                        */
  __IO uint32_t  TNCR;                              /*!< Transmit Next Counter Register                                        */
  __O  uint32_t  PTCR;                              /*!< Transfer Control Register                                             */
  __I  uint32_t  PTSR;                              /*!< Transfer Status Register                                              */
} UART0_Type;


/* ================================================================================ */
/* ================                     CHIPID                     ================ */
/* ================================================================================ */


/**
  * @brief Chip Identifier (CHIPID)
  */

typedef struct {                                    /*!< CHIPID Structure                                                      */
  __I  uint32_t  CIDR;                              /*!< Chip ID Register                                                      */
  __I  uint32_t  EXID;                              /*!< Chip ID Extension Register                                            */
} CHIPID_Type;


/* ================================================================================ */
/* ================                       EFC                      ================ */
/* ================================================================================ */


/**
  * @brief Embedded Flash Controller (EFC)
  */

typedef struct {                                    /*!< EFC Structure                                                         */
  __IO uint32_t  FMR;                               /*!< EEFC Flash Mode Register                                              */
  __O  uint32_t  FCR;                               /*!< EEFC Flash Command Register                                           */
  __I  uint32_t  FSR;                               /*!< EEFC Flash Status Register                                            */
  __I  uint32_t  FRR;                               /*!< EEFC Flash Result Register                                            */
} EFC_Type;


/* ================================================================================ */
/* ================                      PIOA                      ================ */
/* ================================================================================ */


/**
  * @brief Parallel Input/Output Controller A (PIOA)
  */

typedef struct {                                    /*!< PIOA Structure                                                        */
  __O  uint32_t  PER;                               /*!< PIO Enable Register                                                   */
  __O  uint32_t  PDR;                               /*!< PIO Disable Register                                                  */
  __I  uint32_t  PSR;                               /*!< PIO Status Register                                                   */
  __I  uint32_t  RESERVED;
  __O  uint32_t  OER;                               /*!< Output Enable Register                                                */
  __O  uint32_t  ODR;                               /*!< Output Disable Register                                               */
  __I  uint32_t  OSR;                               /*!< Output Status Register                                                */
  __I  uint32_t  RESERVED1;
  __O  uint32_t  IFER;                              /*!< Glitch Input Filter Enable Register                                   */
  __O  uint32_t  IFDR;                              /*!< Glitch Input Filter Disable Register                                  */
  __I  uint32_t  IFSR;                              /*!< Glitch Input Filter Status Register                                   */
  __I  uint32_t  RESERVED2;
  __O  uint32_t  SODR;                              /*!< Set Output Data Register                                              */
  __O  uint32_t  CODR;                              /*!< Clear Output Data Register                                            */
  __IO uint32_t  ODSR;                              /*!< Output Data Status Register                                           */
  __I  uint32_t  PDSR;                              /*!< Pin Data Status Register                                              */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  ISR;                               /*!< Interrupt Status Register                                             */
  __O  uint32_t  MDER;                              /*!< Multi-driver Enable Register                                          */
  __O  uint32_t  MDDR;                              /*!< Multi-driver Disable Register                                         */
  __I  uint32_t  MDSR;                              /*!< Multi-driver Status Register                                          */
  __I  uint32_t  RESERVED3;
  __O  uint32_t  PUDR;                              /*!< Pull-up Disable Register                                              */
  __O  uint32_t  PUER;                              /*!< Pull-up Enable Register                                               */
  __I  uint32_t  PUSR;                              /*!< Pad Pull-up Status Register                                           */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  ABCDSR0;                           /*!< Peripheral Select Register                                            */
  __IO uint32_t  ABCDSR1;                           /*!< Peripheral Select Register                                            */
  __I  uint32_t  RESERVED5[2];
  __O  uint32_t  IFSCDR;                            /*!< Input Filter Slow Clock Disable Register                              */
  __O  uint32_t  IFSCER;                            /*!< Input Filter Slow Clock Enable Register                               */
  __I  uint32_t  IFSCSR;                            /*!< Input Filter Slow Clock Status Register                               */
  __IO uint32_t  SCDR;                              /*!< Slow Clock Divider Debouncing Register                                */
  __O  uint32_t  PPDDR;                             /*!< Pad Pull-down Disable Register                                        */
  __O  uint32_t  PPDER;                             /*!< Pad Pull-down Enable Register                                         */
  __I  uint32_t  PPDSR;                             /*!< Pad Pull-down Status Register                                         */
  __I  uint32_t  RESERVED6;
  __O  uint32_t  OWER;                              /*!< Output Write Enable                                                   */
  __O  uint32_t  OWDR;                              /*!< Output Write Disable                                                  */
  __I  uint32_t  OWSR;                              /*!< Output Write Status Register                                          */
  __I  uint32_t  RESERVED7;
  __O  uint32_t  AIMER;                             /*!< Additional Interrupt Modes Enable Register                            */
  __O  uint32_t  AIMDR;                             /*!< Additional Interrupt Modes Disables Register                          */
  __I  uint32_t  AIMMR;                             /*!< Additional Interrupt Modes Mask Register                              */
  __I  uint32_t  RESERVED8;
  __O  uint32_t  ESR;                               /*!< Edge Select Register                                                  */
  __O  uint32_t  LSR;                               /*!< Level Select Register                                                 */
  __I  uint32_t  ELSR;                              /*!< Edge/Level Status Register                                            */
  __I  uint32_t  RESERVED9;
  __O  uint32_t  FELLSR;                            /*!< Falling Edge/Low Level Select Register                                */
  __O  uint32_t  REHLSR;                            /*!< Rising Edge/ High Level Select Register                               */
  __I  uint32_t  FRLHSR;                            /*!< Fall/Rise - Low/High Status Register                                  */
  __I  uint32_t  RESERVED10;
  __I  uint32_t  LOCKSR;                            /*!< Lock Status                                                           */
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  WPSR;                              /*!< Write Protect Status Register                                         */
  __I  uint32_t  RESERVED11[5];
  __IO uint32_t  SCHMITT;                           /*!< Schmitt Trigger Register                                              */
  __I  uint32_t  RESERVED12[3];
  __IO uint32_t  DELAYR;                            /*!< IO Delay Register                                                     */
  __I  uint32_t  RESERVED13[15];
  __IO uint32_t  PCMR;                              /*!< Parallel Capture Mode Register                                        */
  __O  uint32_t  PCIER;                             /*!< Parallel Capture Interrupt Enable Register                            */
  __O  uint32_t  PCIDR;                             /*!< Parallel Capture Interrupt Disable Register                           */
  __I  uint32_t  PCIMR;                             /*!< Parallel Capture Interrupt Mask Register                              */
  __I  uint32_t  PCISR;                             /*!< Parallel Capture Interrupt Status Register                            */
  __I  uint32_t  PCRHR;                             /*!< Parallel Capture Reception Holding Register                           */
  __IO uint32_t  RPR;                               /*!< Receive Pointer Register                                              */
  __IO uint32_t  RCR;                               /*!< Receive Counter Register                                              */
  __I  uint32_t  RESERVED14[2];
  __IO uint32_t  RNPR;                              /*!< Receive Next Pointer Register                                         */
  __IO uint32_t  RNCR;                              /*!< Receive Next Counter Register                                         */
  __I  uint32_t  RESERVED15[2];
  __O  uint32_t  PTCR;                              /*!< Transfer Control Register                                             */
  __I  uint32_t  PTSR;                              /*!< Transfer Status Register                                              */
} PIOA_Type;


/* ================================================================================ */
/* ================                      PIOB                      ================ */
/* ================================================================================ */


/**
  * @brief Parallel Input/Output Controller B (PIOB)
  */

