ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h
typedef struct {                                    /*!< PIOC Structure                                                        */
  __O  uint32_t  PER;                               /*!< PIO Enable Register                                                   */
  __O  uint32_t  PDR;                               /*!< PIO Disable Register                                                  */
  __I  uint32_t  PSR;                               /*!< PIO Status Register                                                   */
  __I  uint32_t  RESERVED;
  __O  uint32_t  OER;                               /*!< Output Enable Register                                                */
  __O  uint32_t  ODR;                               /*!< Output Disable Register                                               */
  __I  uint32_t  OSR;                               /*!< Output Status Register                                                */
  __I  uint32_t  RESERVED1;
  __O  uint32_t  IFER;                              /*!< Glitch Input Filter Enable Register                                   */
  __O  uint32_t  IFDR;                              /*!< Glitch Input Filter Disable Register                                  */
  __I  uint32_t  IFSR;                              /*!< Glitch Input Filter Status Register                                   */
  __I  uint32_t  RESERVED2;
  __O  uint32_t  SODR;                              /*!< Set Output Data Register                                              */
  __O  uint32_t  CODR;                              /*!< Clear Output Data Register                                            */
  __IO uint32_t  ODSR;                              /*!< Output Data Status Register                                           */
  __I  uint32_t  PDSR;                              /*!< Pin Data Status Register                                              */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  ISR;                               /*!< Interrupt Status Register                                             */
  __O  uint32_t  MDER;                              /*!< Multi-driver Enable Register                                          */
  __O  uint32_t  MDDR;                              /*!< Multi-driver Disable Register                                         */
  __I  uint32_t  MDSR;                              /*!< Multi-driver Status Register                                          */
  __I  uint32_t  RESERVED3;
  __O  uint32_t  PUDR;                              /*!< Pull-up Disable Register                                              */
  __O  uint32_t  PUER;                              /*!< Pull-up Enable Register                                               */
  __I  uint32_t  PUSR;                              /*!< Pad Pull-up Status Register                                           */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  ABCDSR0;                           /*!< Peripheral Select Register                                            */
  __IO uint32_t  ABCDSR1;                           /*!< Peripheral Select Register                                            */
  __I  uint32_t  RESERVED5[2];
  __O  uint32_t  IFSCDR;                            /*!< Input Filter Slow Clock Disable Register                              */
  __O  uint32_t  IFSCER;                            /*!< Input Filter Slow Clock Enable Register                               */
  __I  uint32_t  IFSCSR;                            /*!< Input Filter Slow Clock Status Register                               */
  __IO uint32_t  SCDR;                              /*!< Slow Clock Divider Debouncing Register                                */
  __O  uint32_t  PPDDR;                             /*!< Pad Pull-down Disable Register                                        */
  __O  uint32_t  PPDER;                             /*!< Pad Pull-down Enable Register                                         */
  __I  uint32_t  PPDSR;                             /*!< Pad Pull-down Status Register                                         */
  __I  uint32_t  RESERVED6;
  __O  uint32_t  OWER;                              /*!< Output Write Enable                                                   */
  __O  uint32_t  OWDR;                              /*!< Output Write Disable                                                  */
  __I  uint32_t  OWSR;                              /*!< Output Write Status Register                                          */
  __I  uint32_t  RESERVED7;
  __O  uint32_t  AIMER;                             /*!< Additional Interrupt Modes Enable Register                            */
  __O  uint32_t  AIMDR;                             /*!< Additional Interrupt Modes Disables Register                          */
  __I  uint32_t  AIMMR;                             /*!< Additional Interrupt Modes Mask Register                              */
  __I  uint32_t  RESERVED8;
  __O  uint32_t  ESR;                               /*!< Edge Select Register                                                  */
  __O  uint32_t  LSR;                               /*!< Level Select Register                                                 */
  __I  uint32_t  ELSR;                              /*!< Edge/Level Status Register                                            */
  __I  uint32_t  RESERVED9;
  __O  uint32_t  FELLSR;                            /*!< Falling Edge/Low Level Select Register                                */
  __O  uint32_t  REHLSR;                            /*!< Rising Edge/ High Level Select Register                               */
  __I  uint32_t  FRLHSR;                            /*!< Fall/Rise - Low/High Status Register                                  */
  __I  uint32_t  RESERVED10;
  __I  uint32_t  LOCKSR;                            /*!< Lock Status                                                           */
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  WPSR;                              /*!< Write Protect Status Register                                         */
  __I  uint32_t  RESERVED11[5];
  __IO uint32_t  SCHMITT;                           /*!< Schmitt Trigger Register                                              */
  __I  uint32_t  RESERVED12[3];
  __IO uint32_t  DELAYR;                            /*!< IO Delay Register                                                     */
  __I  uint32_t  RESERVED13[15];
  __IO uint32_t  PCMR;                              /*!< Parallel Capture Mode Register                                        */
  __O  uint32_t  PCIER;                             /*!< Parallel Capture Interrupt Enable Register                            */
  __O  uint32_t  PCIDR;                             /*!< Parallel Capture Interrupt Disable Register                           */
  __I  uint32_t  PCIMR;                             /*!< Parallel Capture Interrupt Mask Register                              */
  __I  uint32_t  PCISR;                             /*!< Parallel Capture Interrupt Status Register                            */
  __I  uint32_t  PCRHR;                             /*!< Parallel Capture Reception Holding Register                           */
} PIOC_Type;


/* ================================================================================ */
/* ================                      PIOD                      ================ */
/* ================================================================================ */


/**
  * @brief Parallel Input/Output Controller D (PIOD)
  */

typedef struct {                                    /*!< PIOD Structure                                                        */
  __O  uint32_t  PER;                               /*!< PIO Enable Register                                                   */
  __O  uint32_t  PDR;                               /*!< PIO Disable Register                                                  */
  __I  uint32_t  PSR;                               /*!< PIO Status Register                                                   */
  __I  uint32_t  RESERVED;
  __O  uint32_t  OER;                               /*!< Output Enable Register                                                */
  __O  uint32_t  ODR;                               /*!< Output Disable Register                                               */
  __I  uint32_t  OSR;                               /*!< Output Status Register                                                */
  __I  uint32_t  RESERVED1;
  __O  uint32_t  IFER;                              /*!< Glitch Input Filter Enable Register                                   */
  __O  uint32_t  IFDR;                              /*!< Glitch Input Filter Disable Register                                  */
  __I  uint32_t  IFSR;                              /*!< Glitch Input Filter Status Register                                   */
  __I  uint32_t  RESERVED2;
  __O  uint32_t  SODR;                              /*!< Set Output Data Register                                              */
  __O  uint32_t  CODR;                              /*!< Clear Output Data Register                                            */
  __IO uint32_t  ODSR;                              /*!< Output Data Status Register                                           */
  __I  uint32_t  PDSR;                              /*!< Pin Data Status Register                                              */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  ISR;                               /*!< Interrupt Status Register                                             */
  __O  uint32_t  MDER;                              /*!< Multi-driver Enable Register                                          */
  __O  uint32_t  MDDR;                              /*!< Multi-driver Disable Register                                         */
  __I  uint32_t  MDSR;                              /*!< Multi-driver Status Register                                          */
  __I  uint32_t  RESERVED3;
  __O  uint32_t  PUDR;                              /*!< Pull-up Disable Register                                              */
  __O  uint32_t  PUER;                              /*!< Pull-up Enable Register                                               */
  __I  uint32_t  PUSR;                              /*!< Pad Pull-up Status Register                                           */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  ABCDSR0;                           /*!< Peripheral Select Register                                            */
  __IO uint32_t  ABCDSR1;                           /*!< Peripheral Select Register                                            */
  __I  uint32_t  RESERVED5[2];
  __O  uint32_t  IFSCDR;                            /*!< Input Filter Slow Clock Disable Register                              */
  __O  uint32_t  IFSCER;                            /*!< Input Filter Slow Clock Enable Register                               */
  __I  uint32_t  IFSCSR;                            /*!< Input Filter Slow Clock Status Register                               */
  __IO uint32_t  SCDR;                              /*!< Slow Clock Divider Debouncing Register                                */
  __O  uint32_t  PPDDR;                             /*!< Pad Pull-down Disable Register                                        */
  __O  uint32_t  PPDER;                             /*!< Pad Pull-down Enable Register                                         */
  __I  uint32_t  PPDSR;                             /*!< Pad Pull-down Status Register                                         */
  __I  uint32_t  RESERVED6;
  __O  uint32_t  OWER;                              /*!< Output Write Enable                                                   */
  __O  uint32_t  OWDR;                              /*!< Output Write Disable                                                  */
  __I  uint32_t  OWSR;                              /*!< Output Write Status Register                                          */
  __I  uint32_t  RESERVED7;
  __O  uint32_t  AIMER;                             /*!< Additional Interrupt Modes Enable Register                            */
  __O  uint32_t  AIMDR;                             /*!< Additional Interrupt Modes Disables Register                          */
  __I  uint32_t  AIMMR;                             /*!< Additional Interrupt Modes Mask Register                              */
  __I  uint32_t  RESERVED8;
  __O  uint32_t  ESR;                               /*!< Edge Select Register                                                  */
  __O  uint32_t  LSR;                               /*!< Level Select Register                                                 */
  __I  uint32_t  ELSR;                              /*!< Edge/Level Status Register                                            */
  __I  uint32_t  RESERVED9;
  __O  uint32_t  FELLSR;                            /*!< Falling Edge/Low Level Select Register                                */
  __O  uint32_t  REHLSR;                            /*!< Rising Edge/ High Level Select Register                               */
  __I  uint32_t  FRLHSR;                            /*!< Fall/Rise - Low/High Status Register                                  */
  __I  uint32_t  RESERVED10;
  __I  uint32_t  LOCKSR;                            /*!< Lock Status                                                           */
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  WPSR;                              /*!< Write Protect Status Register                                         */
  __I  uint32_t  RESERVED11[5];
  __IO uint32_t  SCHMITT;                           /*!< Schmitt Trigger Register                                              */
  __I  uint32_t  RESERVED12[3];
  __IO uint32_t  DELAYR;                            /*!< IO Delay Register                                                     */
  __I  uint32_t  RESERVED13[15];
  __IO uint32_t  PCMR;                              /*!< Parallel Capture Mode Register                                        */
  __O  uint32_t  PCIER;                             /*!< Parallel Capture Interrupt Enable Register                            */
  __O  uint32_t  PCIDR;                             /*!< Parallel Capture Interrupt Disable Register                           */
  __I  uint32_t  PCIMR;                             /*!< Parallel Capture Interrupt Mask Register                              */
  __I  uint32_t  PCISR;                             /*!< Parallel Capture Interrupt Status Register                            */
  __I  uint32_t  PCRHR;                             /*!< Parallel Capture Reception Holding Register                           */
} PIOD_Type;


/* ================================================================================ */
/* ================                      PIOE                      ================ */
/* ================================================================================ */


/**
  * @brief Parallel Input/Output Controller E (PIOE)
  */

typedef struct {                                    /*!< PIOE Structure                                                        */
  __O  uint32_t  PER;                               /*!< PIO Enable Register                                                   */
  __O  uint32_t  PDR;                               /*!< PIO Disable Register                                                  */
  __I  uint32_t  PSR;                               /*!< PIO Status Register                                                   */
  __I  uint32_t  RESERVED;
  __O  uint32_t  OER;                               /*!< Output Enable Register                                                */
  __O  uint32_t  ODR;                               /*!< Output Disable Register                                               */
  __I  uint32_t  OSR;                               /*!< Output Status Register                                                */
  __I  uint32_t  RESERVED1;
  __O  uint32_t  IFER;                              /*!< Glitch Input Filter Enable Register                                   */
  __O  uint32_t  IFDR;                              /*!< Glitch Input Filter Disable Register                                  */
  __I  uint32_t  IFSR;                              /*!< Glitch Input Filter Status Register                                   */
  __I  uint32_t  RESERVED2;
  __O  uint32_t  SODR;                              /*!< Set Output Data Register                                              */
  __O  uint32_t  CODR;                              /*!< Clear Output Data Register                                            */
  __IO uint32_t  ODSR;                              /*!< Output Data Status Register                                           */
  __I  uint32_t  PDSR;                              /*!< Pin Data Status Register                                              */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  ISR;                               /*!< Interrupt Status Register                                             */
  __O  uint32_t  MDER;                              /*!< Multi-driver Enable Register                                          */
  __O  uint32_t  MDDR;                              /*!< Multi-driver Disable Register                                         */
  __I  uint32_t  MDSR;                              /*!< Multi-driver Status Register                                          */
  __I  uint32_t  RESERVED3;
  __O  uint32_t  PUDR;                              /*!< Pull-up Disable Register                                              */
  __O  uint32_t  PUER;                              /*!< Pull-up Enable Register                                               */
  __I  uint32_t  PUSR;                              /*!< Pad Pull-up Status Register                                           */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  ABCDSR0;                           /*!< Peripheral Select Register                                            */
  __IO uint32_t  ABCDSR1;                           /*!< Peripheral Select Register                                            */
  __I  uint32_t  RESERVED5[2];
  __O  uint32_t  IFSCDR;                            /*!< Input Filter Slow Clock Disable Register                              */
  __O  uint32_t  IFSCER;                            /*!< Input Filter Slow Clock Enable Register                               */
  __I  uint32_t  IFSCSR;                            /*!< Input Filter Slow Clock Status Register                               */
  __IO uint32_t  SCDR;                              /*!< Slow Clock Divider Debouncing Register                                */
  __O  uint32_t  PPDDR;                             /*!< Pad Pull-down Disable Register                                        */
  __O  uint32_t  PPDER;                             /*!< Pad Pull-down Enable Register                                         */
  __I  uint32_t  PPDSR;                             /*!< Pad Pull-down Status Register                                         */
  __I  uint32_t  RESERVED6;
  __O  uint32_t  OWER;                              /*!< Output Write Enable                                                   */
  __O  uint32_t  OWDR;                              /*!< Output Write Disable                                                  */
  __I  uint32_t  OWSR;                              /*!< Output Write Status Register                                          */
  __I  uint32_t  RESERVED7;
  __O  uint32_t  AIMER;                             /*!< Additional Interrupt Modes Enable Register                            */
  __O  uint32_t  AIMDR;                             /*!< Additional Interrupt Modes Disables Register                          */
  __I  uint32_t  AIMMR;                             /*!< Additional Interrupt Modes Mask Register                              */
  __I  uint32_t  RESERVED8;
  __O  uint32_t  ESR;                               /*!< Edge Select Register                                                  */
  __O  uint32_t  LSR;                               /*!< Level Select Register                                                 */
  __I  uint32_t  ELSR;                              /*!< Edge/Level Status Register                                            */
  __I  uint32_t  RESERVED9;
  __O  uint32_t  FELLSR;                            /*!< Falling Edge/Low Level Select Register                                */
  __O  uint32_t  REHLSR;                            /*!< Rising Edge/ High Level Select Register                               */
  __I  uint32_t  FRLHSR;                            /*!< Fall/Rise - Low/High Status Register                                  */
  __I  uint32_t  RESERVED10;
  __I  uint32_t  LOCKSR;                            /*!< Lock Status                                                           */
  __IO uint32_t  WPMR;                              /*!< Write Protect Mode Register                                           */
  __I  uint32_t  WPSR;                              /*!< Write Protect Status Register                                         */
  __I  uint32_t  RESERVED11[5];
  __IO uint32_t  SCHMITT;                           /*!< Schmitt Trigger Register                                              */
  __I  uint32_t  RESERVED12[3];
  __IO uint32_t  DELAYR;                            /*!< IO Delay Register                                                     */
  __I  uint32_t  RESERVED13[15];
  __IO uint32_t  PCMR;                              /*!< Parallel Capture Mode Register                                        */
  __O  uint32_t  PCIER;                             /*!< Parallel Capture Interrupt Enable Register                            */
  __O  uint32_t  PCIDR;                             /*!< Parallel Capture Interrupt Disable Register                           */
  __I  uint32_t  PCIMR;                             /*!< Parallel Capture Interrupt Mask Register                              */
  __I  uint32_t  PCISR;                             /*!< Parallel Capture Interrupt Status Register                            */
  __I  uint32_t  PCRHR;                             /*!< Parallel Capture Reception Holding Register                           */
} PIOE_Type;


