ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h
/* ================================================================================ */
/* ================                      RSTC                      ================ */
/* ================================================================================ */


/**
  * @brief Reset Controller (RSTC)
  */

typedef struct {                                    /*!< RSTC Structure                                                        */
  __O  uint32_t  CR;                                /*!< Control Register                                                      */
  __I  uint32_t  SR;                                /*!< Status Register                                                       */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
} RSTC_Type;


/* ================================================================================ */
/* ================                      SUPC                      ================ */
/* ================================================================================ */


/**
  * @brief Supply Controller (SUPC)
  */

typedef struct {                                    /*!< SUPC Structure                                                        */
  __O  uint32_t  CR;                                /*!< Supply Controller Control Register                                    */
  __IO uint32_t  SMMR;                              /*!< Supply Controller Supply Monitor Mode Register                        */
  __IO uint32_t  MR;                                /*!< Supply Controller Mode Register                                       */
  __IO uint32_t  WUMR;                              /*!< Supply Controller Wake Up Mode Register                               */
  __IO uint32_t  WUIR;                              /*!< Supply Controller Wake Up Inputs Register                             */
  __I  uint32_t  SR;                                /*!< Supply Controller Status Register                                     */
} SUPC_Type;


/* ================================================================================ */
/* ================                       RTT                      ================ */
/* ================================================================================ */


/**
  * @brief Real-time Timer (RTT)
  */

typedef struct {                                    /*!< RTT Structure                                                         */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __IO uint32_t  AR;                                /*!< Alarm Register                                                        */
  __I  uint32_t  VR;                                /*!< Value Register                                                        */
  __I  uint32_t  SR;                                /*!< Status Register                                                       */
} RTT_Type;


/* ================================================================================ */
/* ================                       WDT                      ================ */
/* ================================================================================ */


/**
  * @brief Watchdog Timer (WDT)
  */

typedef struct {                                    /*!< WDT Structure                                                         */
  __O  uint32_t  CR;                                /*!< Control Register                                                      */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __I  uint32_t  SR;                                /*!< Status Register                                                       */
} WDT_Type;


/* ================================================================================ */
/* ================                       RTC                      ================ */
/* ================================================================================ */


/**
  * @brief Real-time Clock (RTC)
  */

typedef struct {                                    /*!< RTC Structure                                                         */
  __IO uint32_t  CR;                                /*!< Control Register                                                      */
  __IO uint32_t  MR;                                /*!< Mode Register                                                         */
  __IO uint32_t  TIMR;                              /*!< Time Register                                                         */
  __IO uint32_t  CALR;                              /*!< Calendar Register                                                     */
  __IO uint32_t  TIMALR;                            /*!< Time Alarm Register                                                   */
  __IO uint32_t  CALALR;                            /*!< Calendar Alarm Register                                               */
  __I  uint32_t  SR;                                /*!< Status Register                                                       */
  __O  uint32_t  SCCR;                              /*!< Status Clear Command Register                                         */
  __O  uint32_t  IER;                               /*!< Interrupt Enable Register                                             */
  __O  uint32_t  IDR;                               /*!< Interrupt Disable Register                                            */
  __I  uint32_t  IMR;                               /*!< Interrupt Mask Register                                               */
  __I  uint32_t  VER;                               /*!< Valid Entry Register                                                  */
} RTC_Type;


/* ================================================================================ */
/* ================                      GPBR                      ================ */
/* ================================================================================ */


/**
  * @brief General Purpose Backup Register (GPBR)
  */

