ultimachine/FeynmanCore/system/asf/thirdparty/CMSIS/Utilities/ATSAM4E16E.h
typedef struct {                                    /*!< GPBR Structure                                                        */
  __IO uint32_t  GPBR0;                             /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR1;                             /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR2;                             /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR3;                             /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR4;                             /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR5;                             /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR6;                             /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR7;                             /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR8;                             /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR9;                             /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR10;                            /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR11;                            /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR12;                            /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR13;                            /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR14;                            /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR15;                            /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR16;                            /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR17;                            /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR18;                            /*!< General Purpose Backup Register                                       */
  __IO uint32_t  GPBR19;                            /*!< General Purpose Backup Register                                       */
} GPBR_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif




/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define PWM_BASE                        0x40000000UL
#define AES_BASE                        0x40004000UL
#define CAN0_BASE                       0x40010000UL
#define CAN1_BASE                       0x40014000UL
#define GMAC_BASE                       0x40034000UL
#define CRCCU_BASE                      0x40044000UL
#define SMC_BASE                        0x40060000UL
#define UART1_BASE                      0x40060600UL
#define HSMCI_BASE                      0x40080000UL
#define UDP_BASE                        0x40084000UL
#define SPI_BASE                        0x40088000UL
#define TC0_BASE                        0x40090000UL
#define TC1_BASE                        0x40094000UL
#define TC2_BASE                        0x40098000UL
#define USART0_BASE                     0x400A0000UL
#define USART1_BASE                     0x400A4000UL
#define TWI0_BASE                       0x400A8000UL
#define TWI1_BASE                       0x400AC000UL
#define AFEC0_BASE                      0x400B0000UL
#define AFEC1_BASE                      0x400B4000UL
#define DACC_BASE                       0x400B8000UL
#define ACC_BASE                        0x400BC000UL
#define DMAC_BASE                       0x400C0000UL
#define CMCC_BASE                       0x400C4000UL
#define MATRIX_BASE                     0x400E0200UL
#define PMC_BASE                        0x400E0400UL
#define UART0_BASE                      0x400E0600UL
#define CHIPID_BASE                     0x400E0740UL
#define EFC_BASE                        0x400E0A00UL
#define PIOA_BASE                       0x400E0E00UL
#define PIOB_BASE                       0x400E1000UL
#define PIOC_BASE                       0x400E1200UL
#define PIOD_BASE                       0x400E1400UL
#define PIOE_BASE                       0x400E1600UL
#define RSTC_BASE                       0x400E1800UL
#define SUPC_BASE                       0x400E1810UL
#define RTT_BASE                        0x400E1830UL
#define WDT_BASE                        0x400E1850UL
#define RTC_BASE                        0x400E1860UL
#define GPBR_BASE                       0x400E1890UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define PWM                             ((PWM_Type                *) PWM_BASE)
#define AES                             ((AES_Type                *) AES_BASE)
#define CAN0                            ((CAN0_Type               *) CAN0_BASE)
#define CAN1                            ((CAN1_Type               *) CAN1_BASE)
#define GMAC                            ((GMAC_Type               *) GMAC_BASE)
#define CRCCU                           ((CRCCU_Type              *) CRCCU_BASE)
#define SMC                             ((SMC_Type                *) SMC_BASE)
#define UART1                           ((UART1_Type              *) UART1_BASE)
#define HSMCI                           ((HSMCI_Type              *) HSMCI_BASE)
#define UDP                             ((UDP_Type                *) UDP_BASE)
#define SPI                             ((SPI_Type                *) SPI_BASE)
#define TC0                             ((TC0_Type                *) TC0_BASE)
#define TC1                             ((TC1_Type                *) TC1_BASE)
#define TC2                             ((TC2_Type                *) TC2_BASE)
#define USART0                          ((USART0_Type             *) USART0_BASE)
#define USART1                          ((USART1_Type             *) USART1_BASE)
#define TWI0                            ((TWI0_Type               *) TWI0_BASE)
#define TWI1                            ((TWI1_Type               *) TWI1_BASE)
#define AFEC0                           ((AFEC0_Type              *) AFEC0_BASE)
#define AFEC1                           ((AFEC1_Type              *) AFEC1_BASE)
#define DACC                            ((DACC_Type               *) DACC_BASE)
#define ACC                             ((ACC_Type                *) ACC_BASE)
#define DMAC                            ((DMAC_Type               *) DMAC_BASE)
#define CMCC                            ((CMCC_Type               *) CMCC_BASE)
#define MATRIX                          ((MATRIX_Type             *) MATRIX_BASE)
#define PMC                             ((PMC_Type                *) PMC_BASE)
#define UART0                           ((UART0_Type              *) UART0_BASE)
#define CHIPID                          ((CHIPID_Type             *) CHIPID_BASE)
#define EFC                             ((EFC_Type                *) EFC_BASE)
#define PIOA                            ((PIOA_Type               *) PIOA_BASE)
#define PIOB                            ((PIOB_Type               *) PIOB_BASE)
#define PIOC                            ((PIOC_Type               *) PIOC_BASE)
#define PIOD                            ((PIOD_Type               *) PIOD_BASE)
#define PIOE                            ((PIOE_Type               *) PIOE_BASE)
#define RSTC                            ((RSTC_Type               *) RSTC_BASE)
#define SUPC                            ((SUPC_Type               *) SUPC_BASE)
#define RTT                             ((RTT_Type                *) RTT_BASE)
#define WDT                             ((WDT_Type                *) WDT_BASE)
#define RTC                             ((RTC_Type                *) RTC_BASE)
#define GPBR                            ((GPBR_Type               *) GPBR_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group ATSAM4E16E */
/** @} */ /* End of group Atmel */

#ifdef __cplusplus
}
#endif


#endif  /* ATSAM4E16E_H */

